{
  "name": "strong",
  "price": 199.95,
  "description": "The Armor Jr 7’ x 5’ Baseball L screen comes with a foam and vinyl wrapped black powder-coated steel frame. The foam and vinyl allow schools and teams to outfit their baseball net with their organization’s color. Most importantly, the foam and vinyl wrap drastically decreases deflection when the baseball makes contact with the pitching net frame. In today’s game, most players are taking batting practice from distances around thirty feet which increases the chances of a violent deflection. Furthermore, the foam and vinyl will increase the lifespan of the pitching net, because it prevents the baseball from pinching the net between the ball and frame. The Armor Jr 7’ x 5’ Baseball L screen comes with a foam and vinyl wrapped black powder-coated steel frame. The foam and vinyl allow schools and teams to outfit their baseball net with their organization’s color. Most importantly, the foam and vinyl wrap drastically decreases deflection when the baseball makes contact with the pitching net frame. In today’s game, most players are taking batting practice from distances around thirty feet which increases the chances of a violent deflection. Furthermore, the foam and vinyl will increase the lifespan of the pitching net, because it prevents the baseball from pinching the net between the ball and frame.",
  "source_url": "https://betterbaseball.com/armor-jr-7x5-baseball-l-screen-armorjrbb",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/a/r/armorjr.jpg",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/a/r/armorjr.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Armor_Baseball_L-Screen_Jr_7_x5_\\images\\armor-jr-7x5-baseball-l-screen-armorjrbb_1.jpg"
  ],
  "category_path": [
    "Armor Baseball L-Screen Jr (7'x5')",
    "Baseball L-Screens"
  ],
  "features": [
    "Shipping: FREE & FAST DELIVERY",
    "Durable: 7’H x 5’W L Frame with Hip Guard Protector",
    "Frame: 15 Gauge Black Powder Coated Steel Frame",
    "Netting: #60 UV Treated Poly, Double Layer Pillowcase Netting",
    "Heavy Duty: 18 oz Vinyl & 1 ½” Impact Foam Padding",
    "Reversible \"L\" Shape: for Right & Left-Handed Pitchers",
    "All-Weather Materials: Provides Protection from Outdoor Elements",
    "Match Team Colors: Choose from 11 Color Options",
    "Shipping Dimensions: Screen Box: 46” x 11” x 11” (45 lbs) Pad Kit Box: 14” x 14” x 19” (10 lbs)",
    "Screen Box: 46” x 11” x 11” (45 lbs)",
    "Pad Kit Box: 14” x 14” x 19” (10 lbs)"
  ]
}