{
  "name": "h3",
  "price": 199.95,
  "description": "The 2026 DeMarini Voodoo One Drop 11 USA Baseball Bat is engineered for young athletes seeking a competitive edge on the field. This bat offers a balanced swing feel, thanks to its Ion D End Cap, which ensures a light swing weight while optimizing barrel performance. Crafted with a robust DX1 Alloy Barrel and featuring a 2 3/4 inch diameter, this one-piece alloy bat delivers premium pop and unmatched durability. With its striking blue colorway accented in white, this Voodoo series bat is ready for action straight out of the wrapper, requiring zero break-in period for immediate performance. Certified by USA Baseball, it's the perfect choice for players aiming to elevate their game. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/catalog/product/view/id/177689/s/2026-demarini-voodoo-one-drop-11-usa-baseball-bat-wbd2602010/category/20/",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2602010.jpg",
  "warranty": "Length to Weight Ratio: Drop 11",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2602010.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\Baseball_Bats\\Youth_Baseball_Bats\\USA_Bats\\images\\20_1.jpg"
  ],
  "category_path": [
    "Bats",
    "Baseball Bats",
    "Youth Baseball Bats",
    "USA Bats"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on all orders",
    "Expanded Warranty: Full 1-year through the manufacturer",
    "Length to Weight Ratio: Drop 11",
    "Certification: USA Baseball",
    "Swing Feel: Balanced",
    "Bat Material: One-piece alloy",
    "Barrel Diameter: 2 3/4 Inch",
    "Bat Series: Voodoo",
    "Colorway: Purple with gold accents",
    "Designed For: Unmatched durability & premium pop",
    "Hot Bat Right Out of the Wrapper: Zero break-in period",
    "Ion D End Cap: Light swing weight w/ optimized barrel performance",
    "DX1 Alloy Barrel: High-strength alloy for performance & durability"
  ]
}