{
  "name": "h3",
  "price": 349.95,
  "description": "Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2023-demarini-voodoo-one-bbcor-baseball-bat-wbd2352010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2352010.jpg",
  "warranty": "Drop 3 Baseball Bat (-3 Length To Weight Ratio): Ideal for high school and college players.",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2352010.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2023-demarini-voodoo-one-bbcor-baseball-bat-wbd2352010_1.jpg"
  ],
  "category_path": [
    "Bats",
    "Sale",
    "Closeout Bats",
    "Closeout BBCOR Bats",
    "Baseball Bats",
    "BBCOR Bats"
  ],
  "features": [
    "Fast and Free Shipping: Enjoy quick delivery at no additional cost.",
    "Full 1-Year Manufacturer's Warranty: Comes with a comprehensive warranty for peace of mind.",
    "Drop 3 Baseball Bat (-3 Length To Weight Ratio): Ideal for high school and college players.",
    "BBCOR Certified with .50 Stamp: Meets all collegiate and high school standards.",
    "2 5/8 Inch Barrel Diameter: Provides a large sweet spot for improved performance.",
    "Gold and Black Colorway: Stylish design that stands out on the field.",
    "Balanced Design: Offers a combination of balance and power, suitable for both contact and power hitters.",
    "No Break-In Period: Game-ready performance straight from the wrapper.",
    "Reinforced End Cap: Enhances durability without compromising swing speed.",
    "Balanced Swing Feel: Ideal for hitters seeking a light-swinging bat with elite performance.",
    "Available Sizes: 29in/26oz, 30in/27oz, 31in/28oz, 32in/29oz, 33in/30oz, and 34in/31oz."
  ]
}