{
  "name": "h3",
  "price": 89.99,
  "description": "Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2023-rawlings-storm-drop-13-fastpitch-softball-bat-fp3s13",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/f/p/fp3s13.jpg",
  "warranty": "Description chevron-down chevron-down chevron-down Description Dominate the field with the Rawlings Storm -13 Fastpitch Bat, built for young players developing their skills. Its one-piece, all-alloy construction provides durability while keeping the bat lightweight and easy to swing. Featuring an X-Tended Sweetspot, the extended barrel maximizes surface area for better contact. With a drop 13 length-to-weight ratio, this ultra-light bat helps players generate faster swing speeds. Approved for multiple leagues, this bat is perfect for beginners looking for performance at an affordable price.",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/f/p/fp3s13.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2023-rawlings-storm-drop-13-fastpitch-softball-bat-fp3s13_1.jpg"
  ],
  "category_path": [
    "Bats",
    "Rawlings Storm Drop 13 Fastpitch Softball Bat: FP3S13"
  ],
  "features": [
    "Free Shipping: Delivered at no extra cost",
    "Drop 13 Length-To-Weight: Ultra-light for fast swings",
    "2 1/4\" Barrel Diameter: Standard for fastpitch play",
    "Balanced Swing Weight: Smooth and controlled performance",
    "One-Piece Alloy: Durable and lightweight design",
    "Certified for Fastpitch: ASA, USSSA, NSA, ISA & ISF approved",
    "X-Tended Sweetspot: Maximized surface area for better contact",
    "12-Month Warranty: Full manufacturer’s coverage"
  ]
}