{
  "name": "h3",
  "price": 299.95,
  "description": "The 2024 Louisville Slugger Select PWR Drop 10 USA Bat is engineered for optimal performance and feel, making it a top choice for serious players. Certified by USSSA with a 1.15 BPF stamp, this bat features a balanced swing feel and a hybrid construction with an alloy barrel and composite handle. The EXD Alloy Barrel delivers a huge sweet spot and premium pop, while the VCX2 Connection reduces vibration for enhanced comfort. The SPD-Gen2 End Cap maximizes barrel performance, and the LS Pro Comfort Grip offers the perfect mix of tack and cushion. With its striking orange, blue, and black colorway, the Select PWR combines style and power for maximum momentum and distance on the field. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2024-louisville-slugger-select-pwr-used-drop-10-usa-baseball-bat-wbl2818010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl2818010.jpg",
  "warranty": "Length to Weight Ratio: Drop 10",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl2818010.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2024-louisville-slugger-select-pwr-used-drop-10-usa-baseball-bat-wbl2818010_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 10",
    "Certification: USSSA Certified With 1.15 BPF Stamp",
    "Swing Feel: Balanced",
    "Bat Material: Hybrid - Alloy Barrel & Composite Handle",
    "Barrel Diameter: 2 5/8 Inch",
    "Bat Series: Select PWR",
    "Colorway: Orange, Blue, & Black",
    "EXD Alloy Barrel: Equips Huge Sweet Spot with Premium Pop",
    "VCX2 Connection: Reduces Vibration & Supplies Premium Comfort",
    "SPD-Gen2 End Cap: Designed to Maximize Barrel Performance",
    "Power Swing Weight: For Maximum Momentum & Distance",
    "LS Pro Comfort Grip: Exhibits Perfect Mix Of Tack & Cushion"
  ]
}