{
  "name": "h3",
  "price": 299.95,
  "description": "The 2024 Mizuno CRBN1 Drop 10 Fastpitch Softball Bat is a game-changer for both contact and power hitters, boasting advanced features and certifications from USSSA, USA Softball (ASA), NSA, ISA, and WBSC. This one-piece alloy bat showcases a 2 1/4 inch barrel diameter and a striking white, black, and purple colorway. Its innovative X-Zone Technology optimizes composite angles across 10 zones, creating a massive sweet spot, while the Anti-Shock Construction significantly reduces vibrations for a smoother swing. The bat's Black Onyx Carbon ensures enhanced durability and a game-ready feel, complemented by the Speed Helix Grip for superior comfort. With an optimized end cap for great sound and more pop, this bat is designed to elevate your performance on the field. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2024-mizuno-crbn1-drop-10-fastpitch-softball-bat-340659",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/3/4/340659.jpg",
  "warranty": "Bat Series: CRBN1",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/3/4/340659.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2024-mizuno-crbn1-drop-10-fastpitch-softball-bat-340659_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on All Orders",
    "Expanded Warranty: 1-Year through Mizuno",
    "Bat Series: CRBN1",
    "Length to Weight Ratio: Drop 10",
    "Certification: USSSA, USA Softball (ASA), NSA, ISA & WBSC",
    "Bat Material: One-Piece Alloy",
    "Barrel Diameter: 2 1/4 Inch",
    "Hitting Style: Built for Contact & Power Hitters",
    "Colorway: White, Black & Purple",
    "X-Zone Technology: Optimizes Composite Angles in 10 Zones for a Massive Sweet Spot",
    "Anti-Shock Construction: Reduces Vibrations",
    "Cylinder Seaming: Consistency across the Barrel",
    "Black Onyx Carbon: More Durability & Game Ready",
    "Optimized End Cap: Great Sound & More Pop on the Sweet Spot",
    "Speed Helix Grip: Provides Comfort & Durability"
  ]
}