{
  "name": "h3",
  "price": 249.95,
  "description": "Introducing the Louisville Slugger Nexus Drop 12 Fastpitch Softball Bat, a top-tier choice for players seeking exceptional performance and balance on the field. Certified by USSSA, USA Softball (ASA), NSA, ISA, and WBSC, this bat is designed to meet the standards of elite softball leagues. Its 2-piece composite construction features a 2 1/4 inch barrel diameter, providing a balanced swing feel for optimal control. The striking white, orange, and black colorway complements the advanced Mash Composite Barrel, which ensures peak performance, while the XCT Connection Piece enhances the feel at impact. Additionally, the COPA End Cap maximizes the sweet spot, making the Nexus Fastpitch series a must-have for serious athletes. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2024-louisville-slugger-nexus-drop-12-fastpitch-softball-bat-wbl2814010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl2814010.jpeg",
  "warranty": "Length to Weight Ratio: Drop 12",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl2814010.jpeg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2024-louisville-slugger-nexus-drop-12-fastpitch-softball-bat-wbl2814010_1.jpeg"
  ],
  "category_path": [
    "Bats",
    "2024 Louisville Slugger Nexus Drop 12 Fastpitch Softball Bat: WBL2814010"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 12",
    "Certification: USSSA, USA Softball (ASA), NSA, ISA & WBSC",
    "Swing Feel: Balanced",
    "Bat Material: 2-Piece Composite",
    "Barrel Diameter: 2 1/4 Inch",
    "Bat Series: Nexus Fastpitch",
    "Colorway: White, Orange & Black",
    "Mash Composite Barrel: For Optimal Performance",
    "XCT Connection Piece: For Great Feel at Impact",
    "COPA End Cap: Maximizes the Sweet Spot"
  ]
}