{
  "name": "h3",
  "price": 199.95,
  "description": "Introducing the Demarini Voodoo One Drop 10 JBB Baseball Bat, a game-changer for young athletes seeking superior performance on the field. This bat is USSSA 1.15 BPF certified, ensuring top-tier quality and compliance. Its balanced swing feel, combined with the innovative Tracer End Cap, enhances bat speed for those crucial hits. The Voodoo series bat boasts an X14 Alloy Barrel, offering a massive barrel and easy-swinging experience, delivering unmatched durability and premium pop right out of the wrapper with zero break-in period. Featuring a vibrant orange and white colorway, this bat is designed for players who demand the best in performance and style. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2025-demarini-voodoo-one-drop-10-jbb-baseball-bat-wbd2540010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2540010.jpeg",
  "warranty": "Length to Weight Ratio: Drop 10",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2540010.jpeg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2025-demarini-voodoo-one-drop-10-jbb-baseball-bat-wbd2540010_1.jpeg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on ALL Orders",
    "Expanded Warranty: Full 1-Year through Demarini",
    "Length to Weight Ratio: Drop 10",
    "Certification: USSSA 1.15 BPF Certification",
    "Swing Feel: Balanced",
    "Bat Material: One-Piece Alloy",
    "Barrel Diameter: 2 3/4 Inch",
    "Bat Series: Voodoo",
    "Colorway: Orange & White",
    "Designed For: Unmatched Durability & Premium Pop",
    "Hot Bat Right Out of the Wrapper: Zero Break-In Period",
    "Tracer End Cap: For Enhanced Bat Speed",
    "X14 Alloy Barrel: Massive Barrel & Easy-Swinging"
  ]
}