{
  "name": "h3",
  "price": 119.99,
  "description": "Discover the 2025 Marucci F5 Drop 10 JBB Baseball Bat, designed for young players aged 5-7 in coach pitch leagues. Certified with USSSA 1.15 BPF, this bat delivers a balanced swing feel, ideal for developing confident hitters. Its one-piece alloy construction features a 2 3/4 inch barrel diameter in a striking teal and white colorway. The bat boasts a multi-variable wall design, offering an expanded sweet spot and enhanced durability, while the ring-free barrel construction ensures high performance without dead spots. Equipped with a micro-perforated soft-touch grip, the Marucci F5 provides a comfortable swing with extra tack, making it a top choice for young athletes. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2025-marucci-f5-drop-10-jbb-baseball-bat-mjbbf54",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/j/mjbbf54.jpg",
  "warranty": "Length to Weight Ratio: Drop 10",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/j/mjbbf54.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2025-marucci-f5-drop-10-jbb-baseball-bat-mjbbf54_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on ALL Orders",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 10",
    "Certification: USSSA 1.15 BPF Certified",
    "Swing Feel: Balanced",
    "Bat Material: One-Piece Alloy Composite",
    "Barrel Diameter: 2 3/4 Inch",
    "Colorway: Teal & White",
    "Intended for: Coach Pitch, Ages 5-7",
    "Multi-Variable Wall Design: Expanded Sweet Spot with Added Durability",
    "Ring-Free Barrel Construction: High Performance without Dead Spots",
    "Micro-Perforated Soft-Touch Grip: For a Comfortable Swing & Extra Tack"
  ]
}