{
  "name": "h3",
  "price": 199.99,
  "description": "The 2025 Marucci Code BBCOR Baseball Bat stands out with its impressive features, designed to enhance your performance on the field. With a mid-loaded swing feel, this bat offers a balanced and powerful swing, perfect for serious players. Crafted from a robust one-piece alloy construction, the AZ75 Alloy ensures all-season durability. The innovative AV2 Knob features a harmonic dampening system, providing an improved feel with each hit. Additionally, the ring-free barrel construction and multi-variable wall design expand the sweet spot, offering more forgiving off-centered performance. This bat's striking black, lime, and white colorway complements its advanced technology and design. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2025-marucci-code-bbcor-baseball-bat-mcbcd",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/c/mcbcd.jpg",
  "warranty": "Length to Weight Ratio: Drop 3 (-3)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/c/mcbcd.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2025-marucci-code-bbcor-baseball-bat-mcbcd_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on all orders",
    "Warranty: Full 1-year through the manufacturer",
    "Length to Weight Ratio: Drop 3 (-3)",
    "Certification: BBCOR .50 Certified",
    "Barrel Diameter: 2 5/8 Inch",
    "Swing Feel: Mid-Loaded",
    "Bat Material: One-piece alloy construction",
    "Colorway: Black, lime & white",
    "AZ75 Alloy: All-season durability",
    "AV2 Knob: Harmonic dampening system for better feel",
    "Ring-Free Barrel Construction: Enhances barrel flex & overall bat production",
    "Multi-Variable Wall Design: Expanded sweet spot & thinner walls for more forgiving off-centered performance"
  ]
}