{
  "name": "h3",
  "price": 199.95,
  "description": "Step up to the plate with the Louisville Slugger Savannah Bananas JBB Drop 10 Coach Pitch Bat, designed for young sluggers eager to make an impact. This USSSA Certified bat showcases a balanced swing feel, perfect for coach pitch hitting, with a 2 3/4 inch barrel diameter for a larger sweet spot. Crafted from SL Hyper Alloy, this bat offers maximum pop, while the premium end cap enhances its balanced feel, ensuring every swing is smooth and controlled. The vibrant blue, yellow, and white colorway not only stands out visually but is complemented by the Premium LS Pro Comfort Grip, providing increased tack and cushion for superior control and feel. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2025-louisville-slugger-savannah-bananas-jbb-drop-10-coach-pitch-bat-wbl4006010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl4006010.jpeg",
  "warranty": "Length to Weight Ratio: Drop 10",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl4006010.jpeg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2025-louisville-slugger-savannah-bananas-jbb-drop-10-coach-pitch-bat-wbl4006010_1.jpeg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 10",
    "Certification: USSSA Certified - Displays USSSA 1.15 BPF Stamp",
    "Swing Feel: Balanced",
    "Bat Material: One-Piece Alloy",
    "Barrel Diameter: 2 3/4 Inch",
    "Hitting Style: Coach Pitch",
    "Colorway: BLue, Yellow & White",
    "SL Hyper Alloy: Superlight Alloy with Maximum Pop",
    "Premium End Cap: Enhances Balanced Feel",
    "Premium LS Pro Comfort Grip: Increased Tack & Cushion for Control & Feel"
  ]
}