{
  "name": "h3",
  "price": 139.99,
  "description": "Discover the 2025 Marucci Code Drop 10 USA Baseball Bat, engineered for peak performance with its mid-loaded swing feel and 2 5/8 inch barrel diameter. This bat features a striking green and black colorway and is crafted with Marucci's revolutionary AZ75 Alloy for all-season durability. Equipped with a 2nd-Gen AV2 knob, it offers a harmonic dampening system that enhances overall feel during play. The innovative ring-free barrel construction and multi-variable wall design provide an expanded sweet spot and thinner walls, ensuring more forgiving off-centered hits. Certified for USA Baseball, this bat is designed to elevate your game with unmatched precision and power. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2025-marucci-code-drop-10-usa-baseball-bat-msbcd10usa",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcd10usa.jpg",
  "warranty": "Length to Weight Ratio: Drop 10",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcd10usa.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2025-marucci-code-drop-10-usa-baseball-bat-msbcd10usa_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on ALL Orders",
    "Warranty: Full Twelve (12) Months through the Manufacturer",
    "Length to Weight Ratio: Drop 10",
    "Barrel Diameter: 2 5/8 Inch",
    "Swing Feel: Mid-Loaded",
    "Bat Material: One-Piece Alloy Construction",
    "Colorway: Green & Black",
    "Certification: USA",
    "AZ75 Alloy: All-Season Durability",
    "2nd-Gen AV2 Knob: Harmonic Dampening System for Better Feel",
    "Ring-Free Barrel Construction: Enhances Barrel Flex & Overall Bat Production",
    "Multi-Variable Wall Design: Expanded Sweet Spot and Thinner Walls for More Forgiving Off-centered Performance"
  ]
}