{
  "name": "h3",
  "price": 119.99,
  "description": "Introducing the 2025 Marucci F5 Drop 10 USSSA Baseball Bat, a top choice for young athletes seeking peak performance on the field. This bat boasts a balanced swing feel, thanks to its one-piece alloy construction, and features a 2 3/4 inch barrel diameter for optimal contact. The baby blue and white colorway adds a stylish touch, while the multi-variable wall design ensures an expanded sweet spot and added durability. With ring-free barrel construction for high performance without dead spots and a micro-perforated soft-touch grip for a comfortable swing, this bat is USSSA 1.15 BPF certified for competitive play. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2025-marucci-f5-drop-10-usssa-baseball-bat-msbf5410",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbf5410.jpg",
  "warranty": "Length to Weight Ratio: Drop 10",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbf5410.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2025-marucci-f5-drop-10-usssa-baseball-bat-msbf5410_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on ALL Orders",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 10",
    "Certification: USSSA 1.15 BPF Certified",
    "Swing Feel: Balanced",
    "Bat Material: One-Piece Alloy Composite",
    "Barrel Diameter: 2 3/4 Inch",
    "Colorway: Green & White",
    "Multi-Variable Wall Design: Expanded Sweet Spot with Added Durability",
    "Ring-Free Barrel Construction: High Performance without Dead Spots",
    "Micro-Perforated Soft-Touch Grip: For a Comfortable Swing & Extra Tack"
  ]
}