{
  "name": "h3",
  "price": 249.95,
  "description": "Discover the 2025 Demarini Drop 12 Fastpitch Softball Bat, a game-changer for players seeking a balanced swing and superior performance. Certified by USSSA, USA Softball (ASA), NSA, ISA, and WBSC, this bat features a two-piece composite design with a 2 1/4 inch barrel diameter. The vibrant white, purple, and green colorway complements the innovative Paradox Composite Barrel, engineered for a softer, hotter, and more responsive feel. Experience reduced hand vibration with the D-Lite Composite Handle and the Big D End Cap, ensuring every swing is smooth and powerful. Elevate your game with the Spryte series, designed for players who demand excellence on the field. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2025-demarini-spryte-drop-12-fastpitch-softball-bat-wbd2553010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2553010.jpeg",
  "warranty": "Length to Weight Ratio: Drop 12",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2553010.jpeg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2025-demarini-spryte-drop-12-fastpitch-softball-bat-wbd2553010_1.jpeg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 12",
    "Certification: USSSA, USA Softball (ASA), NSA, ISA & WBSC",
    "Swing Feel: Balanced",
    "Bat Material: Two-Piece Composite",
    "Barrel Diameter: 2 1/4 Inch",
    "Bat Series: Spryte",
    "Colorway: White, Purple & Green",
    "Paradox Composite Barrel: Designed for a Softer, Hotter & More Responsive Feel",
    "D-Lite Composite Handle: Reduces Hand Vibration",
    "Big D End Cap: Absorbs Vibration on Hands"
  ]
}