{
  "name": "h3",
  "price": 299.99,
  "description": "Introducing the 2025 Easton MAV1 BBCOR Baseball Bat, engineered for peak performance with a balanced swing feel that enhances every player's game. This bat boasts a Drop 3 length-to-weight ratio, ensuring optimal control and power at the plate. Certified by BBCOR, the MAV1 features a 2 5/8 inch barrel diameter and is crafted with Extra Long Draw Alloy Processing, resulting in a 7% thinner wall for a larger sweet spot. The innovative MAV HP Alloy provides an ultra-balanced swing weight, while the sleek taper handle allows for superior barrel control, making this bat a game-changer for serious athletes. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2025-easton-mav1-bbcor-baseball-bat-ebb5mav3",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/e/b/ebb5mav3.jpg",
  "warranty": "Length to Weight Ratio: Drop 3",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/e/b/ebb5mav3.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2025-easton-mav1-bbcor-baseball-bat-ebb5mav3_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 3",
    "Certification: BBCOR",
    "Swing Feel: Balanced",
    "Bat Material: One-Piece Aluminum",
    "Barrel Diameter: 2 5/8 Inch",
    "Extra Long Draw Alloy Processing: 7% Thinner Wall for Larger Sweet Spot",
    "MAV HP Alloy: Ultra-Balanced Swing Weight",
    "Sleek Taper Handle: More Barrel Control"
  ]
}