{
  "name": "h3",
  "price": 149.99,
  "description": "The 2025 Marucci Code Drop 10 USSSA Baseball Bat is engineered for players seeking a powerful yet controlled swing, thanks to its mid-loaded swing feel and one-piece alloy construction. Certified by BBCOR .50, this bat features a 2 3/4 inch barrel diameter, crafted from robust AZ75 alloy for all-season durability. Its ring-free barrel construction and multi-variable wall design work together to enhance barrel flex and expand the sweet spot, ensuring a more forgiving performance even on off-centered hits. Finished in a striking black, lime, and white colorway, the bat also incorporates an AV2 knob with a harmonic dampening system, delivering an improved feel with reduced vibrations. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2025-marucci-code-drop-10-usssa-baseball-bat-msbcd10",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcd10.jpg",
  "warranty": "Length to Weight Ratio: Drop 10 (-10)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcd10.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2025-marucci-code-drop-10-usssa-baseball-bat-msbcd10_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on all orders",
    "Warranty: Full 1-year through the manufacturer",
    "Length to Weight Ratio: Drop 10 (-10)",
    "Certification: USSSA 1.15 BPF Certified",
    "Barrel Diameter: 2 3/4 Inch",
    "Swing Feel: Mid-Loaded",
    "Bat Material: One-piece alloy construction",
    "Colorway: Black, lime & white",
    "AZ75 Alloy: All-season durability",
    "AV2 Knob: Harmonic dampening system for better feel",
    "Ring-Free Barrel Construction: Enhances barrel flex & overall bat production",
    "Multi-Variable Wall Design: Expanded sweet spot & thinner walls for more forgiving off-centered performance"
  ]
}