{
  "name": "h3",
  "price": 349.99,
  "description": "Discover the 2025 Tucci XV BBCOR Baseball Bat, a game-changer for athletes seeking precision and power. Engineered with a balanced swing weight and ultra-low MOI, this bat ensures optimal control and speed through the zone. The one-piece alloy construction features a 2 5/8 inch barrel diameter with a rolled barrel end, extending the sweet spot and reducing breakage, while the innovative TX3 Alloy offers high-strength durability. Its vibrant green, teal, and gold colorway not only stands out on the field but also highlights the advanced technology behind its design. Certified to meet BBCOR standards, this bat is ideal for players aiming to elevate their performance with a reliable and powerful tool. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2025-tucci-xv-bbcor-baseball-bat-61311503",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/6/1/61311503.jpg",
  "warranty": "Length to Weight Ratio: Drop 3",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/6/1/61311503.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2025-tucci-xv-bbcor-baseball-bat-61311503_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on ALL Orders",
    "Expanded Warranty: 1-Year through Tucci",
    "Length to Weight Ratio: Drop 3",
    "Certification: BBCOR Certified",
    "Bat Material: One-Piece Alloy",
    "Barrel Diameter: 2 5/8 Inch",
    "Bat Series: XV",
    "Swing Weight: Balanced (Ultra-Low MOI)",
    "Colorway: Green, Teal & Gold",
    "Rolled Barrel End: Extends Sweet Spot & Reduces Breakage",
    "Variable Wall: Creates Large Sweet Spot",
    "TX3 Alloy: High-Strength for Added Durability"
  ]
}