{
  "name": "h3",
  "price": 149.99,
  "description": "The 2025 Marucci Code Drop 8 USSSA Baseball Bat is engineered for performance, boasting a mid-loaded swing feel that enhances power. Its one-piece alloy construction, crafted from durable AZ75 Alloy, ensures all-season reliability. The innovative AV2 Knob incorporates a harmonic dampening system, providing players with a superior feel and reduced vibration. Featuring a 2 3/4 inch barrel diameter, the bat's ring-free barrel construction and multi-variable wall design create an expanded sweet spot, offering exceptional barrel flex and forgiving off-centered hits. With a striking black, lime, and white colorway, this bat is a game-changer for serious athletes. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2025-marucci-code-drop-8-usssa-baseball-bat-msbcd8",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcd8.jpg",
  "warranty": "Length to Weight Ratio: Drop 8 (-8)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcd8.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2025-marucci-code-drop-8-usssa-baseball-bat-msbcd8_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on all orders",
    "Warranty: Full 1-year through the manufacturer",
    "Length to Weight Ratio: Drop 8 (-8)",
    "Certification: USSSA 1.15 BPF Certified",
    "Barrel Diameter: 2 3/4 Inch",
    "Swing Feel: Mid-Loaded",
    "Bat Material: One-piece alloy construction",
    "Colorway: Black, lime & white",
    "AZ75 Alloy: All-season durability",
    "AV2 Knob: Harmonic dampening system for better feel",
    "Ring-Free Barrel Construction: Enhances barrel flex & overall bat production",
    "Multi-Variable Wall Design: Expanded sweet spot & thinner walls for more forgiving off-centered performance"
  ]
}