{
  "name": "h3",
  "price": 69.99,
  "description": "Introducing the 2025 Victus Vibe Yellow Crayon Drop 11 USA Tee Ball Bat, designed to let young athletes express their creativity on the field. This innovative bat, available in your favorite color, combines extreme durability with high-end performance, ensuring it out-draws the competition. Its one-piece aluminum construction features a ring-free barrel and an extreme performance alloy, providing the flex needed for powerful swings. The vibration-reducing knob and custom tapered handle allow hitters to confidently attack any pitch, while the micro-perforated soft-touch grip ensures superior control. Certified for various youth leagues and backed by a one-year warranty, this bat is ready to help players step up to the plate and paint the field in style. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2025-victus-vibe-yellow-crayon-drop-11-usa-tee-ball-bat-vtbvibc-yl",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/v/t/vtbvibc-yl.jpg",
  "warranty": "Length to Weight Ratio: Drop 11",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/v/t/vtbvibc-yl.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2025-victus-vibe-yellow-crayon-drop-11-usa-tee-ball-bat-vtbvibc-yl_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on all orders",
    "Warranty: Full 1-year through the manufacturer",
    "Length to Weight Ratio: Drop 11",
    "Certification: USA Certified",
    "Swing Feel: Mid-balanced",
    "Bat Material: One-piece alloy composite",
    "Barrel Diameter: 2 5/8 Inch",
    "Colorway: Yellow & Black",
    "VXP Alloy: Increase pop & extended durability",
    "Ringless Barrel Construction: Creates a thinner, more flexible sweet spot",
    "Micro-Perforated Soft-Touch Grip: Improves feel & control"
  ]
}