{
  "name": "h3",
  "price": 349.0,
  "description": "Introducing the 2025 Warstic Bonesaber Drop 10 Fastpitch Softball Bat, a speed loaded powerhouse designed for players who want to maximize their performance on the field. The Katana Speed Composite Barrel is made from the highest-grade multi-directional composite, allowing for a faster break-in time and unmatched power output. The patented Pommel Precision Knob provides a pro-style grip that offers superior comfort and control with every swing. The optimized connection piece reduces vibration for a smoother, more comfortable feel on contact, while the Tsuka Max Warrior's Grip offers enhanced cushion and tack for a secure hold. With a Feather Lite Composite Cap for increased durability and dual stamp approval for USA and USSSA sanctioned play, this bat is backed by a 12-month warranty for added peace of mind. Elevate your game with the 2025 Warstic Bonesaber Drop 10 Fastpitch Softball Bat. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 273 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2025-warstic-bonesaber-drop-10-fastpitch-softball-bat",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/f/p/fpbsr25wh10.jpg",
  "warranty": "Length to Weight Ratio: Drop 10 (-10)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/f/p/fpbsr25wh10.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2025-warstic-bonesaber-drop-10-fastpitch-softball-bat_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 10 (-10)",
    "Certification: USSSA, USA Softball (ASA), NSA, ISA & WBSC",
    "Swing Feel: Balanced",
    "Bat Material: Two-Piece Composite",
    "Barrel Diameter: 2 1/4 Inch",
    "Bat Series: Bonesaber",
    "Katana Speed Composite Barrel: Max performance",
    "Pommel Precision Knob: Pro-style comfort and control",
    "Optimized Connection Piece: Less vibration, smoother feel",
    "Tsuka Max Warrior’s Grip: Thicker, cushioned, tacky",
    "Feather Lite Composite Cap: Durable, max swing speed"
  ]
}