{
  "name": "h3",
  "price": 449.99,
  "description": "The 2025 Easton Ghost OG Drop 9 Fastpitch Softball Bat is the ultimate tool for players looking to dominate at the plate. Engineered with Easton’s signature Double Barrel design, this Ghost bat delivers an unparalleled combination of maximum pop and a smooth, balanced swing feel. Its 2-piece composite construction, paired with Sonic Comp technology, ensures both exceptional durability and high-level performance throughout every inning. Certified for play in ISA, WBSC, NSA, USSSA, and USA Softball leagues, this Easton Ghost Fastpitch Softball Bat is designed to meet the needs of players competing at the highest level. The sleek blue, grey, and white colorway adds a modern edge to the Ghost Drop 9, while advanced features like the Power Boost \"Soft Knob\" and ConneXion Technology redefine comfort and power. The soft knob minimizes vibration, reducing hand fatigue during intense games, while the ConneXion system enhances energy transfer for explosive hits. With a 2 1/4-inch barrel diameter and a balanced swing feel, this bat caters to players seeking both speed and control. The 2025 Easton Ghost Fastpitch Softball Bat is more than just a bat—it's a game-changer for athletes who demand precision, power, and peak performance. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2025-easton-ghost-og-drop-9-fastpitch-softball-bat-efp5ghog9",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/e/f/efp5ghog9.jpg",
  "warranty": "Length to Weight Ratio: Drop 10",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/e/f/efp5ghog9.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2025-easton-ghost-og-drop-9-fastpitch-softball-bat-efp5ghog9_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 10",
    "Certification: ISA, WBSC, NSA, USSSA, & USA Softball",
    "Swing Feel: Balanced",
    "Bat Material: 2-Piece Composite",
    "Barrel Diameter: 2 1/4 Inch",
    "Colorway: Blue, Grey, and White",
    "Double Barrel Design: For Max Pop & Light Swing",
    "Sonic Comp Technology: For Maximum Performance and Durability",
    "Power Boost \"Soft Knob\": Reduced Vibration and Enhanced Comfort",
    "ConneXion Technology: Reduces Vibration and Enhances Power"
  ]
}