{
  "name": "h3",
  "price": 89.99,
  "description": "The 2025 Demarini Uprising Drop 12 Fastpitch Softball Bat is a top-tier choice for players seeking a balanced swing feel and superior performance. Certified for USSSA, USA Softball (ASA), NSA, ISA, and WBSC play, this bat is versatile and competition-ready. Its one-piece alloy construction, featuring a 2 1/4 inch barrel diameter, is crafted from high-strength DX1 Alloy, delivering a more responsive feel with every hit. The vibrant purple and pink colorway adds a stylish touch, while the Big D End Cap is designed to absorb vibrations, ensuring a smooth and comfortable swing experience. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2025-demarini-uprising-drop-12-fastpitch-softball-bat-wbd2555010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2555010.jpeg",
  "warranty": "Length to Weight Ratio: Drop 12",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2555010.jpeg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2025-demarini-uprising-drop-12-fastpitch-softball-bat-wbd2555010_1.jpeg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 12",
    "Certification: USSSA, USA Softball (ASA), NSA, ISA & WBSC",
    "Swing Feel: Balanced",
    "Bat Material: One-Piece Alloy",
    "Barrel Diameter: 2 1/4 Inch",
    "Bat Series: Uprising",
    "Colorway: Purple & Pink",
    "DX1 Alloy Barrel: High Strength Alloy for More Responsive Feel",
    "Big D End Cap: Helps Absorb Vibration"
  ]
}