{
  "name": "h3",
  "price": 179.99,
  "description": "Introducing the 2025 Victus Vibe Pink Crayon Drop 10 JBB Baseball Bat, designed for young athletes aged 5-7 playing coach pitch. This bat boasts a mid-balanced swing feel, thanks to its innovative one-piece alloy composite construction, ensuring increased pop and extended durability with the VXP Alloy technology. The ringless barrel construction creates a thinner, more flexible sweet spot, while the micro-perforated soft-touch grip enhances feel and control. Certified with USSSA 1.15 BPF and featuring a 2 3/4-inch barrel diameter, the bat is perfect for young players seeking performance. Enjoy FAST & FREE shipping on all orders and a full 1-year warranty through the manufacturer. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2025-victus-vibe-pink-crayon-drop-10-jbb-baseball-bat-vjbbvibc-pk",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/v/j/vjbbvibc-pk.jpg",
  "warranty": "Length to Weight Ratio: Drop 10",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/v/j/vjbbvibc-pk.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2025-victus-vibe-pink-crayon-drop-10-jbb-baseball-bat-vjbbvibc-pk_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on ALL Orders",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 10",
    "Certification: USSSA 1.15 BPF Certified",
    "Swing Feel: Mid-Balanced",
    "Bat Material: One-Piece Alloy Composite",
    "Barrel Diameter: 2 3/4 Inch",
    "Colorway: Pink & Black",
    "Intended for: Coach Pitch, Ages 5-7",
    "VXP Alloy: Increase Pop & Extended Durability",
    "Ringless Barrel Construction: Creates a Thinner, More Flexible Sweet Spot",
    "Micro-Perforated Soft-Touch Grip: Improves Feel & Control"
  ]
}