{
  "name": "h3",
  "price": 139.99,
  "description": "Experience the 2025 Marucci Code Drop 10 JBB Baseball Bat, engineered for peak performance with a mid-loaded swing feel that enhances your power at the plate. Featuring a 2 3/4 inch barrel diameter, this one-piece alloy bat is crafted from the durable USA AZ75 Alloy, ensuring all-season reliability. The sleek black, lime, and white colorway adds a stylish touch, while the 2nd-Gen AV2 Knob delivers a superior feel by dampening vibrations. With its ring-free barrel construction and multi-variable wall design, this bat offers an expanded sweet spot and thinner walls for improved performance, even on off-centered hits. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2025-marucci-code-drop-10-jbb-baseball-bat-mjbbcd",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/j/mjbbcd.jpg",
  "warranty": "Length to Weight Ratio: Drop 10",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/j/mjbbcd.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2025-marucci-code-drop-10-jbb-baseball-bat-mjbbcd_1.jpg"
  ],
  "category_path": [
    "Bats",
    "Baseball Bats",
    "Youth Baseball Bats",
    "Coach Pitch Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on ALL Orders",
    "Warranty: Full Twelve (12) Months through the Manufacturer",
    "Length to Weight Ratio: Drop 10",
    "Barrel Diameter: 2 3/4 Inch",
    "Swing Feel: Mid-Loaded",
    "Bat Material: One-Piece Alloy Construction",
    "Colorway: Black, Lime & White",
    "Certification: USA",
    "AZ75 Alloy: All-Season Durability",
    "2nd-Gen AV2 Knob: Harmonic Dampening System for Better Feel",
    "Ring-Free Barrel Construction: Enhances Barrel Flex & Overall Bat Production",
    "Multi-Variable Wall Design: Expanded Sweet Spot and Thinner Walls for More Forgiving Off-centered Performance"
  ]
}