{
  "name": "h3",
  "price": 299.0,
  "description": "Introducing the 2025 Warstic Bonesaber Hybrid Drop 5 USSSA Baseball Bat, a game-changer for serious players seeking performance and precision. With its balanced swing feel, this bat ensures a perfect blend of control and power, thanks to its innovative 2-piece hybrid design featuring a composite handle and a Katana2X alloy barrel. The 2 5/8 inch barrel diameter is crafted to maximize the sweet spot and enhance whip through the zone, while the Featherlite Aerophite Cap boosts swing speed for those crucial game moments. The Pommel Precision Knob and Tsuka Pro-Tact Grip provide pro-style comfort and control, making it the ideal choice for athletes who demand excellence on the field. Certified by USSSA, this black and cream masterpiece is part of the renowned Bonesaber Hybrid series, designed to elevate your game to the next level. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 273 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2025-warstic-bonesaber-hybrid-drop-5-usssa-baseball-bat-mbbsh25wh5",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/b/mbbsh25wh5_1.jpg",
  "warranty": "Length to Weight Ratio: Drop 5",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/b/mbbsh25wh5_1.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2025-warstic-bonesaber-hybrid-drop-5-usssa-baseball-bat-mbbsh25wh5_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "D elivery: Fast & Free Shipping",
    "1-Year Warranty: Through Warstic",
    "Length to Weight Ratio: Drop 5",
    "Certification: USSSA Certified",
    "Swing Feel: Balanced",
    "Bat Material: 2-Piece Hybrid (Composite Handle & Alloy Barrel)",
    "Barrel Diameter: 2 5/8 Inch",
    "Bat Series: Bonesaber Hybrid",
    "Colorway: Black & Cream",
    "Katana2X Alloy Barrel: Maximize Sweet Spot & Increase Whip Thru Zone",
    "Pommel Precision Knob: Pro Style for Comfort & Control",
    "Tsuka Pro-Tact Grip: Increased Tackiness & Cushioning  for Control & Comfort",
    "Featherlite Aerophite Cap: Increased Swing Speed"
  ]
}