{
  "name": "h3",
  "price": 449.95,
  "description": "Introducing the 2025 Mizuno CRBN Pro Drop 10 Fastpitch Softball Bat, a top choice for players seeking unparalleled performance and style. With its sleek white, black, and purple colorway, this bat is certified by USSSA, USA Softball (ASA), NSA, ISA, and WBSC, ensuring it meets the highest standards. The two-piece composite design features a 2 1/4 inch barrel diameter, optimized for both contact and power hitters. Key innovations like the Detonator Cor for low barrel compression and the Dual Frequency Dampener for reduced vibrations enhance your game, while the Black Onyx Carbon construction offers durability and a game-ready feel. Experience consistent power with Cylinder Seaming and enjoy the great sound and pop of the optimized end cap, all while maintaining comfort with the Speed Helix Grip. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2025-mizuno-crbn-pro-drop-10-fastpitch-softball-bat-340665",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/3/4/340665.jpg",
  "warranty": "Bat Series: CRBN Pro",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/3/4/340665.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2025-mizuno-crbn-pro-drop-10-fastpitch-softball-bat-340665_1.jpg"
  ],
  "category_path": [
    "Bats",
    "Softball Bats",
    "Fastpitch Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on All Orders",
    "Expanded Warranty: 1-Year through Mizuno",
    "Bat Series: CRBN Pro",
    "Length to Weight Ratio: Drop 10",
    "Certification: USSSA, USA Softball (ASA), NSA, ISA & WBSC",
    "Bat Material: Two-Piece Composite",
    "Barrel Diameter: 2 1/4 Inch",
    "Hitting Style: Built for Contact & Power Hitters",
    "Colorway: White & Black",
    "Detonator Cor: Low Barrel Compression for Better Performance & Sound",
    "Dual Frequency Dampener: Reduces Vibrations & Flex for High Performance",
    "Cylinder Seaming: Consistency across the Barrel",
    "Black Onyx Carbon: More Durability & Game Ready",
    "Optimized End Cap: Great Sound & More Pop on the Sweet Spot",
    "Speed Helix Grip: Provides Comfort & Durability"
  ]
}