{
  "name": "h3",
  "price": 149.99,
  "description": "The 2026 Easton MAV1 Flash Drop 11 USA Baseball Bat is the ultimate choice for young athletes looking to enhance their game with speed, control, and style. Designed specifically for rising players, this ultra-lightweight bat features a drop 11 length-to-weight ratio and a 2 5/8-inch barrel diameter for a swift swing and reliable contact. Its MAV HP Alloy construction offers a forgiving barrel with an expanded sweet spot, boosting player confidence and performance early in their development. The XLD Optimized Barrel Performance enhances pop across the surface, even on off-center hits, while the Enhanced Handle Design and 2.2mm Flex Grip ensure comfort and control. Finished in vibrant Peach, Pink, Purple, and Blue, the MAV1 Flash not only delivers exceptional performance but also stands out with its striking appearance. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-easton-mav1-flash-drop-11-usa-baseball-bat-eus6m1f11",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/e/u/eus6m1f11.jpg",
  "warranty": "Length to Weight Ratio: Drop 11",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/e/u/eus6m1f11.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-easton-mav1-flash-drop-11-usa-baseball-bat-eus6m1f11_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 11",
    "Certification: USA Certified",
    "Swing Feel: Balanced",
    "Bat Material: One-Piece Alloy",
    "Barrel Diameter: 2 5/8 Inch",
    "Color: Peach Gradient & Blue",
    "MAV HP Alloy: Larger & consistent sweet spot",
    "XLD Optimized Barrel: Increases performance across the entire barrel",
    "Enhanced Handle: Smooth taper for more control & comfortable feel"
  ]
}