{
  "name": "h3",
  "price": 249.95,
  "description": "The 2026 Louisville Slugger Atlas Drop 5 USSSA Baseball Bat is engineered for players seeking a balanced swing and enhanced performance. With its USSSA 1.15 BPF certification, this bat features a 2 3/4 inch barrel diameter, offering a substantial sweet spot thanks to the innovative XPND End Cap. The SL Hyper Superlight Alloy construction ensures a light swing with maximum pop, while the Pro Design Knob Taper provides additional leverage during your swing. Complemented by a stylish grey, teal, and white colorway, the bat also includes a Premium LS Pro Comfort Grip for superior control and comfort. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-louisville-slugger-atlas-drop-5-usssa-baseball-bat-wbl4123010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl4123010.jpg",
  "warranty": "Length to Weight Ratio: Drop 5 (-5)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl4123010.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-louisville-slugger-atlas-drop-5-usssa-baseball-bat-wbl4123010_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on all orders",
    "Warranty: Full 1-year through the manufacturer",
    "Length to Weight Ratio: Drop 5 (-5)",
    "Certification: USSSA 1.15 BPF Certified",
    "Swing Feel: Balanced",
    "Bat Material: One-piece alloy",
    "Barrel Diameter: 2 3/4 Inch",
    "Colorway: Grey, Teal, & White",
    "SL Hyper Superlight Alloy: For light-swinging, maximum pop",
    "XPND End Cap: Expands the sweet spot, improving performance & feel",
    "Pro Design Knob Taper: Provides more leverage through the swing",
    "Premium LS Pro Comfort Grip: Increased tack & cushion for control & feel"
  ]
}