{
  "name": "h3",
  "price": 399.95,
  "description": "Set off the warning sirens when you step up with the 2026 DeMarini Omega Electric Yellow (-3) BBCOR Baseball Bat, designed for unmatched durability and premium pop. The limited edition Yellow X14 Alloy Barrel offers a massive sweet spot, allowing high school and college hitters to barrel up fastballs and curveballs with ease. With a mid-loaded swing feel, the 1275 Composite Handle provides a lightweight, comfortable grip that reduces hand sting on contact. The upgraded Direct Connection enhances durability while maintaining forgiveness, and the Tracer End Cap boosts barrel speed and performance, making this bat a formidable choice for any lineup. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-demarini-omega-electric-yellow-bbcor-baseball-bat-wbd2635010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2635010.jpg",
  "warranty": "Length to Weight Ratio: Drop 3",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2635010.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-demarini-omega-electric-yellow-bbcor-baseball-bat-wbd2635010_1.jpg"
  ],
  "category_path": [
    "Bats",
    "2026 DeMarini Omega \"Electric Yellow\" BBCOR Baseball Bat: WBD2635010"
  ],
  "features": [
    "D elivery: Fast & Free Shipping on all orders",
    "Warranty: Full 1-Year through the manufacturer",
    "Length to Weight Ratio: Drop 3",
    "Certification: BBCOR Certified",
    "Bat Series: Omega",
    "Swing Feel: Mid-Loaded",
    "Bat Material: 2-piece hybrid (Composite handle & alloy barrel)",
    "Barrel Diameter: 2 5/8 Inch",
    "Colorway: Yellow & black",
    "Designed For: Unmatched durability & premium pop",
    "Upgraded Direct Connection: Improves durability & maintains forgiveness",
    "Tracer End Cap: Enhanced barrel speed & performance",
    "X14 Alloy Barrel: Massive barrel for improved accuracy",
    "1275 Composite Handle: Lightweight composite for easy-to-control swing"
  ]
}