{
  "name": "h3",
  "price": 399.95,
  "description": "The 2026 DeMarini CF Drop 11 Fastpitch Softball Bat is crafted for young contact hitters and slappers seeking a lightweight swing and consistent performance. Its Paraflex™ Plus Composite Barrel ensures reliable results and total plate command, making it a favorite among rising travel ball stars and high school players. The bat's Type-V™ Connection minimizes hand-stinging vibrations, allowing young athletes to develop their swings with confidence. With a balanced swing feel and vibrant white, pink, and purple colorway, the CF Drop 11 is designed to enhance bat speed and barrel performance, creating chaos on the field. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-demarini-cf-drop-11-fastpitch-softball-bat-wbd2630010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2630010.jpg",
  "warranty": "Length to Weight Ratio: Drop 11 (-11)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2630010.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-demarini-cf-drop-11-fastpitch-softball-bat-wbd2630010_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on all orders",
    "Warranty: Full 1-year through the manufacturer",
    "Length to Weight Ratio: Drop 11 (-11)",
    "Certification: USSSA, USA Softball (ASA), NSA, ISA & WBSC",
    "Swing Feel: Balanced",
    "Bat Material: Two-piece composite",
    "Barrel Diameter: 2 1/4 Inch",
    "Handle Size: 0.800\" Handle to dampen vibrations",
    "Colorway: White, Pink, & Purple",
    "Tracer End Cap: Enhances bat speed & barrel performance",
    "Paraflex Plus Composite: Provides massive sweet spot & responsiveness",
    "Type V Connection: Reduces hand vibration and transfers energy to the barrel"
  ]
}