{
  "name": "h3",
  "price": 399.99,
  "description": "The 2026 Louisville Slugger Supra Drop 5 USSSA Baseball Bat is engineered for peak performance with its balanced swing feel, making it an ideal choice for players seeking both power and precision. Featuring a striking teal, pink, and black colorway, this bat is crafted from a two-piece composite material, ensuring it's game-ready right out of the wrapper. The 2 3/4 inch barrel diameter, enhanced by the XPND End Cap, maximizes barrel performance, while the VCXS Connection minimizes hand stings, providing crucial feedback for every swing. With its Pro Design Taper and LS Pro Comfort grip, this bat guarantees improved comfort, leverage, and increased tack and cushion, helping players elevate their game to new heights. Designed to meet USSSA certification standards, the Supra series continues to push boundaries in baseball bat innovation. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-louisville-slugger-supra-drop-5-usssa-baseball-bat-slsrx5",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/s/l/slsrx5.jpg",
  "warranty": "Length to Weight Ratio: Drop 5",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/s/l/slsrx5.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-louisville-slugger-supra-drop-5-usssa-baseball-bat-slsrx5_1.jpg"
  ],
  "category_path": [
    "Bats",
    "2026 Louisville Slugger Supra Drop 5 USSSA Baseball Bat: SLSRX5"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 5",
    "Certification: USSSA",
    "Swing Feel: Balanced",
    "Bat Material: Two-Piece Composite",
    "Barrel Diameter: 2 3/4 Inch",
    "Bat Series: Supra",
    "Colorway: Teal, Pink, & Black",
    "Supra APX Composite: Game ready out of the wrapper",
    "XPND End Cap: Maximizes Barrel Performance",
    "VCXS Connection: Minimizes hand stings w/ feedback",
    "Pro Design Taper: Improves comfort & offers more leverage",
    "LS Pro Comfort: Increased tack & cushion"
  ]
}