{
  "name": "h3",
  "price": 349.99,
  "description": "The 2026 Easton Hype Fire Drop 11 USA Baseball Bat is designed for young athletes seeking a balanced swing and optimal performance. With its USA Baseball certification, this bat features a two-piece composite construction and a 2 5/8 inch barrel diameter, perfect for contact and power hitters alike. The innovative 3D Ropecoil Composite technology wraps the barrel’s sweet spot for consistent performance, while the Connexion Max elastomer connector minimizes vibration for a smooth feel. The Opti-Flex Handle is tailored for elite travel ball players, complemented by the Flow Tack grip and Power Boost Soft knob for enhanced comfort, feel, and control. The vibrant green, yellow, and pink colorway adds a striking visual appeal to the Hype Fire series. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-easton-hype-fire-drop-11-usa-baseball-bat-eus6hyp11",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/e/u/eus6hyp11.jpg",
  "warranty": "Length to Weight Ratio: Drop 11 (-11)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/e/u/eus6hyp11.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-easton-hype-fire-drop-11-usa-baseball-bat-eus6hyp11_1.jpg"
  ],
  "category_path": [
    "Bats",
    "2026 Easton Hype Fire Drop 11 USA Baseball Bat: EUS6HYP11",
    "Baseball Bats",
    "Youth Baseball Bats",
    "USA Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 11 (-11)",
    "Certification: USA Baseball Certified",
    "Swing Feel: Balanced",
    "Bat Material: Two-Piece Composite",
    "Barrel Diameter: 2 5/8 Inch",
    "Colorway: Green, yellow, & pink",
    "Bat Series: Hype Fire",
    "Hitting Style: Contact & Power Hitter",
    "3D Ropecoil Composite : 3D Composite rope wrapped 360° around the barrel’s sweet spot to expand performance across the entire barrel",
    "Connexion Max : Elastomer connector to eliminate vibration for optimal feel",
    "Opti-Flex Handle : Engineered by size for elite travel ball athletes",
    "Enhanced Grip & Feel : Flow Tack grip & Power Boost Soft knob for comfort, feel, & control"
  ]
}