{
  "name": "h3",
  "price": 149.99,
  "description": "The 2026 Easton MAV1 Flash JBB Drop 10 Baseball Bat is the perfect choice for young hitters aiming to excel in coach pitch or machine pitch games. This vibrant bat, finished in an eye-catching Peach, Pink, Purple, and Blue colorway, is designed for players aged 5 to 7. Its lightweight, balanced swing feel and innovative features Wavewall Technology and a Power Boost Soft Knob enhance performance and comfort. The Flashpoint Alloy construction maximizes energy transfer, making it easier for young athletes to generate bat speed and control. With the USSSA 1.15 BPF Certification and a 12-month warranty, the MAV1 Flash JBB ensures quality and confidence at the plate. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-easton-mav1-flash-jbb-drop-10-baseball-bat-ejb6m1f10",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/e/j/ejb6m1f10.jpg",
  "warranty": "Length to Weight Ratio: Drop 10",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/e/j/ejb6m1f10.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-easton-mav1-flash-jbb-drop-10-baseball-bat-ejb6m1f10_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 10",
    "Certification: USSSA Certified - Displays USSSA 1.15 BPF Stamp",
    "Swing Feel: Balanced",
    "Bat Material: One-Piece Alloy",
    "Barrel Diameter: 2 3/4 Inch",
    "Color: Peach Gradient & Blue",
    "Flashpoint Alloy: Ultra-Balanced Swing Weight",
    "Wavewall Technology: Optimized barrel wall for better results on mis-hits",
    "Power Boost Knob: Increases leverage, power, & reduce vibrations"
  ]
}