{
  "name": "h3",
  "price": 279.99,
  "description": "Introducing the 2026 Marucci CATX Reckless Drop 5 USSSA Baseball Bat, a game-changer for serious players. With a balanced swing feel and a 2 3/4 inch barrel diameter, this one-piece alloy bat is USSSA 1.15 BPF certified, offering exceptional performance on the field. Its sleek black, sky blue, and red colorway is just the beginning; the ring-free barrel construction enhances barrel flex and overall production, while the AZR Alloy ensures optimal plate performance and responsiveness. The AV3 Vibration Dampener absorbs vibrations for unmatched comfort, and the multi-variable wall design expands the sweet spot with forgiving barrel walls. Complete with a TFX End Cap for increased forgiveness, a custom knob design for better feel, and an enhanced soft touch grip for superior control, this bat is designed to elevate your game. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-marucci-catx-reckless-drop-5-usssa-baseball-bat-msbcr5",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcr5.jpg",
  "warranty": "Length to Weight Ratio: Drop 5 (-5)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcr5.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-marucci-catx-reckless-drop-5-usssa-baseball-bat-msbcr5_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: Free & Fast Shipping on all orders",
    "Warranty: Full twelve (12) months through the manufacturer",
    "Length to Weight Ratio: Drop 5 (-5)",
    "Certification: USSSA 1.15 BPF Certified",
    "Barrel Diameter: 2 3/4 Inch",
    "Swing Feel: Balanced",
    "Bat Material: One-piece alloy",
    "Colorway: Black, Sky Blue, & Red",
    "Ring-Free Barrel Construction: Enhances barrel flex & overall bat production",
    "AZR Alloy: Ensures optimal plate performance & bat responsiveness",
    "AV3 Vibration Dampener: Absorbs vibrations & sting for feel & comfort",
    "Multi-Variable Wall Design: Expanded sweet spot w/ forgiving barrel walls",
    "TFX End Cap: Softer end cap increases forgiveness",
    "Custom Knob Design: Optimized knob shape for each drop for better feel",
    "Enhanced Soft Touch Grip: Enhances feel & control"
  ]
}