{
  "name": "h3",
  "price": 299.99,
  "description": "Introducing the 2026 Soldier Tank Drip BBCOR Baseball Bat, the ultimate powerhouse on the field with an enormous barrel profile and an even hotter performance than last year's model. Scientifically developed by real hitters and genius-level engineers, this bat features an expanded sweet spot and boasts the best possible score on the BBCOR test. The Infused Power Alloy Technology and new carbon fiber speed end cap deliver an incredibly light swing weight, providing extreme whip and power, making every hit feel like a trampoline. Built for both power and contact hitters, its soft comfort tack grip and tapered comfort handle ensure maximum control and reduced hand ringing. Officially the metal bat of Perfect Game, this one-piece, NCAA-approved bat is designed for high school and college play, offering unmatched speed, mass, and impact for extreme power. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-soldier-tank-drip-bbcor-baseball-bat-st-bb-1-26",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/s/t/st-bb-1-26.jpg",
  "warranty": "Length to Weight Ratio: Drop 3",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/s/t/st-bb-1-26.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-soldier-tank-drip-bbcor-baseball-bat-st-bb-1-26_1.jpg"
  ],
  "category_path": [
    "Bats",
    "2026 Soldier Tank Drip BBCOR Baseball Bat: ST-BB-1-26"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 3",
    "Certification: BBCOR .50 Certified",
    "Approved For: High School & College Play",
    "Swing Feel: Balanced",
    "Bat Material: One-Piece Alloy",
    "Barrel Diameter: 2 5/8 Inch",
    "Bat Series: Soldier Tank",
    "Colorway: Green, Black & Pink",
    "Hitter Type: Contact & Power",
    "Extremely Whippy Barrel: Propels bat through hitting zone",
    "Speed X Mass X Impact: Extreme power",
    "Power Alloy Technology: Lightweight & enormous sweet spot",
    "Carbon Fiber End Cap: Added speed & power",
    "Full Taper Handle: Provides increased control & vibration dampening"
  ]
}