{
  "name": "h3",
  "price": 399.95,
  "description": "Introducing the 2026 Louisville Slugger Select PWR BBCOR Baseball Bat, a top-tier choice for high school and college players seeking unparalleled performance. This bat features a slightly end-loaded swing feel, thanks to its two-piece hybrid construction with an alloy barrel and composite handle, ensuring powerful hits with every swing. The EXD Alloy Barrel boasts a massive sweet spot and exceptional pop, while the 3FX-PWR Connection enhances comfort and energy transfer. With its SPD-Gen3 End Cap and Pro Design Knob Taper, this bat is engineered for optimized barrel performance, improved control, and maximum swing momentum. Finished in a striking black, grey, and red colorway, the Select PWR is equipped with a Premium PRO Comfort Grip for superior tack and cushioning, making it a standout choice for any serious player. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-louisville-slugger-select-pwr-bbcor-baseball-bat-wbl4115010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl4115010.jpg",
  "warranty": "Length to Weight Ratio: Drop 3",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl4115010.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-louisville-slugger-select-pwr-bbcor-baseball-bat-wbl4115010_1.jpg"
  ],
  "category_path": [
    "Bats",
    "2026 Louisville Slugger Select PWR BBCOR Baseball Bat: WBL4115010"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on all orders",
    "Warranty: Full 1-year through the manufacturer",
    "Length to Weight Ratio: Drop 3",
    "Certification: BBCOR .50 Certified",
    "Approved For: High school & college play",
    "Swing Feel: Slightly End-Loaded",
    "Bat Material: Two-piece hybrid - Alloy barrel & composite handle",
    "Barrel Diameter: 2 5/8 Inch",
    "Bat Series: Select PWR",
    "Colorway: Black, Grey, & Red",
    "EXD Alloy Barrel: Equips huge sweet spot with premium pop",
    "3FX-PWR Connection: Optimal comfort & enhanced energy transfer",
    "SPD-Gen3 End Cap: Designed to optimize barrel performance",
    "Pro Design Knob Taper: Improves comfort, control & leverage",
    "Power Swing Weight: For maximum momentum & distance",
    "Premium PRO Comfort Grip: Superior tack & cushion"
  ]
}