{
  "name": "h3",
  "price": 349.99,
  "description": "The 2026 Easton Hype Fire Drop 8 USA Baseball Bat is designed for elite travel ball athletes seeking a balanced swing feel and optimal performance. Certified by USA Baseball, this two-piece composite bat features a 2 5/8 inch barrel diameter and a vibrant colorway of green, yellow, and pink. With the innovative 3D Ropecoil Composite technology, the barrel’s sweet spot is expanded for enhanced performance, while the Connexion Max elastomer connector minimizes vibrations for a smoother hit. The Opti-Flex Handle, tailored by size, and the Flow Tack grip with a Power Boost Soft knob provide superior comfort, feel, and control, making it ideal for both contact and power hitters. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-easton-hype-fire-drop-8-usa-baseball-bat-eus6hyp8",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/e/u/eus6hyp8.jpg",
  "warranty": "Length to Weight Ratio: Drop 8 (-8)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/e/u/eus6hyp8.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-easton-hype-fire-drop-8-usa-baseball-bat-eus6hyp8_1.jpg"
  ],
  "category_path": [
    "Bats",
    "2026 Easton Hype Fire Drop 8 USA Baseball Bat: EUS6HYP8"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 8 (-8)",
    "Certification: USA Baseball Certified",
    "Swing Feel: Balanced",
    "Bat Material: Two-Piece Composite",
    "Barrel Diameter: 2 5/8 Inch",
    "Colorway: Green, yellow, & pink",
    "Bat Series: Hype Fire",
    "Hitting Style: Contact & Power Hitter",
    "3D Ropecoil Composite : 3D Composite rope wrapped 360° around the barrel’s sweet spot to expand performance across the entire barrel",
    "Connexion Max : Elastomer connector to eliminate vibration for optimal feel",
    "Opti-Flex Handle : Engineered by size for elite travel ball athletes",
    "Enhanced Grip & Feel : Flow Tack grip & Power Boost Soft knob for comfort, feel, & control"
  ]
}