{
  "name": "h3",
  "price": 499.99,
  "description": "Elevate your game with the 2026 Easton Dub Drop 8 USSSA Baseball Bat, a powerhouse designed for players who bring energy and confidence to every at-bat. Featuring Easton’s cutting-edge Double Barrel technology, this bat boasts the lowest barrel compression in its class, offering increased flex and elite performance across its entire length. Its two-piece composite construction minimizes vibration while the ConneXion Max elastomer connection ensures smooth, powerful contact, even on mishits. The Optiflex handle is engineered for optimal balance, providing the perfect blend of flex and stiffness for improved barrel control and raw power. With its striking design and game-changing power, the Easton Dub is your ultimate companion for dominating the diamond. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-easton-dub-drop-8-usssa-baseball-bat-eut6dub8",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/e/u/eut6dub8.jpg",
  "warranty": "Length to Weight Ratio: Drop 8",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/e/u/eut6dub8.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-easton-dub-drop-8-usssa-baseball-bat-eut6dub8_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "X1 Bat Per Household: Due to High Demand",
    "D elivery: FAST & FREE shipping",
    "Warranty: Full 1-Year through the manufacturer",
    "Length to Weight Ratio: Drop 8",
    "Certification: USSSA certified",
    "Swing Feel: Barrel-Loaded",
    "Bat Material: Two-piece composite",
    "Barrel Diameter: 2 3/4 Inch",
    "Colorway: White, Yellow, & Pink",
    "Bat Series: Dub",
    "Hitting Style: Contact & power hitter",
    "Double Barrel: Increased flex & elite performance across the barrel",
    "ConneXion Max Connector: Smooth & powerful contact",
    "OptiFlex Handle: Provides perfect balance of stiffness & flex"
  ]
}