{
  "name": "h3",
  "price": 199.95,
  "description": "The 2026 Louisville Slugger Dynasty BBCOR Baseball Bat is expertly designed to elevate your game with its impressive features. With a drop 3 length-to-weight ratio and BBCOR .50 certification, this bat offers a balanced swing feel, ideal for players seeking precision and power. Its one-piece alloy construction and 2 5/8 inch barrel diameter are enhanced by the SPD-Gen2 End Cap, which maximizes swing speed and barrel performance. The bat's standout gold, green, and black colorway adds style, while the Tuned Mass Damper ensures vibration-dampening for smooth swings. The TPX-24 Alloy delivers increased stiffness, bat speed, and energy transfer, complemented by a Pro Design Knob Taper for added comfort, control, and leverage, along with the LS Pro Comfort Grip for ultimate tack and cushion. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-louisville-slugger-dynasty-bbcor-baseball-bat-wbl4162010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl4162010.jpg",
  "warranty": "Length to Weight Ratio: Drop 3 (-3)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl4162010.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-louisville-slugger-dynasty-bbcor-baseball-bat-wbl4162010_1.jpg"
  ],
  "category_path": [
    "Bats",
    "Baseball Bats",
    "BBCOR Bats",
    "2026 Louisville Slugger Dynasty BBCOR Baseball Bat: WBL4162010"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on all orders",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 3 (-3)",
    "Certification: BBCOR .50 Certified",
    "Swing Feel: Balanced",
    "Bat Material: One-piece alloy",
    "Barrel Diameter: 2 5/8 Inch",
    "Bat Series: Louisville Slugger Dynasty",
    "Colorway: Gold, Green & Black",
    "SPD-Gen2 End Cap: Maximizes swing speed & barrel performance",
    "Tuned Mass Damper: Vibration-dampening handle for smooth swings",
    "TPX-24 Alloy: Increased stiffness, bat speed, & energy transfer",
    "Pro Design Knob Taper: Added comfort, control, & leverage",
    "LS Pro Comfort Grip: Ultimate tack & cushion"
  ]
}