{
  "name": "h3",
  "price": 449.95,
  "description": "The 2026 Louisville Slugger Kryo Drop 10 Fastpitch Softball Bat is expertly designed to elevate your game with its perfect blend of performance, balance, and feel. Ideal for a diverse range of players, this bat features a balanced swing weight, enabling fast bat speed and precise barrel control, ensuring both power and consistency at the plate. The innovative GO-EX1 Barrel System, with its high-performance gapped wall design and bullet-proof internal disc system, delivers explosive performance, a smooth feel, and a satisfying sound on contact. Enhancing the experience, the VTX Connection Piece allows for independent movement between the barrel and handle, reducing vibrations and appealing to both contact and power hitters, while the Patented XPND End Cap optimizes barrel performance. With the Premium LS Pro Comfort Grip for added control and certified for multiple leagues, the Kryo Drop 10 is poised to offer game-changing performance. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-louisville-slugger-kryo-drop-10-fastpitch-softball-bat-wbl4135010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl4135010.jpg",
  "warranty": "Length to Weight Ratio: Drop 10",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl4135010.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-louisville-slugger-kryo-drop-10-fastpitch-softball-bat-wbl4135010_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: Fast & Free Shipping",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 10",
    "Certification: USSSA, ISA, WBSC, NSA, & USA Softball (ASA)",
    "Swing Feel: Balanced",
    "Bat Material: Two-Piece Composite",
    "Barrel Diameter: 2 1/4 Inch",
    "Colorway: Teal & White",
    "VTX Connection Piece: Reduces hand vibration",
    "GO-EX1 Barrel System: Gapped wall design enhances pop & sound",
    "XPND Performance End Cap: Maximize the sweet spot & responsiveness",
    "Premium LS Pro Comfort Grip: For a comfortable swings w/ improved comfort"
  ]
}