{
  "name": "h3",
  "price": 199.99,
  "description": "The 2026 Marucci CATX RCKLESS Drop 11 USA Baseball Bat is engineered for young athletes seeking optimal performance on the field. Featuring a balanced swing feel and a striking red, black, and sky blue colorway, this bat is crafted with a one-piece alloy construction. Its 2 5/8-inch barrel diameter and ring-free barrel construction enhance barrel flex and overall production, while the AZR alloy ensures exceptional plate performance and responsiveness. The AV3 Vibration Dampener minimizes vibrations for improved comfort, and the multi-variable wall design expands the sweet spot with forgiving barrel walls. Additionally, the TFX end cap and custom knob design provide increased forgiveness and a tailored feel, complemented by an enhanced soft touch grip for superior control. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-marucci-catx-rckless-drop-11-usa-baseball-bat-msbcr11usa",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcr11usa.jpg",
  "warranty": "Length to Weight Ratio: Drop 11 (-11)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcr11usa.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-marucci-catx-rckless-drop-11-usa-baseball-bat-msbcr11usa_1.jpg"
  ],
  "category_path": [
    "Bats",
    "2026 Marucci CATX RCKLESS Drop 11 USA Baseball Bat: MSBCR11USA"
  ],
  "features": [
    "Delivery: Free & Fast Shipping on all orders",
    "Warranty: Full twelve (12) months through the manufacturer",
    "Length to Weight Ratio: Drop 11 (-11)",
    "Certification: USA Baseball Certified",
    "Barrel Diameter: 2 5/8 Inch",
    "Swing Feel: Balanced",
    "Bat Material: One-piece alloy",
    "Colorway: Red, black, & sky blue",
    "Ring-Free Barrel Construction: Enhances barrel flex & overall bat production",
    "AZR Alloy: Ensures optimal plate performance & bat responsiveness",
    "AV3 Vibration Dampener: Absorbs vibrations & sting for feel & comfort",
    "Multi-Variable Wall Design: Expanded sweet spot w/ forgiving barrel walls",
    "TFX End Cap: Softer end cap increases forgiveness",
    "Custom Knob Design: Optimized knob shape for each drop for better feel",
    "Enhanced Soft Touch Grip: Enhances feel & control"
  ]
}