{
  "name": "h3",
  "price": 399.99,
  "description": "Introducing the 2026 Soldier Tank Drip Drop 10 Fastpitch Softball Bat, a groundbreaking innovation in softball technology. Engineered with proprietary Trampoline Quad-Wall Technology, this bat delivers a \"pop\" so powerful it's akin to a trampoline, thanks to years of meticulous research and development in composite materials. Its incredibly light swing weight, combined with the new Carbon Fiber Speed End Cap, ensures swift, powerful swings, making it the official metal bat of Perfect Game. Designed for both power and contact hitters, the enlarged ultra-hot sweet spot and Infused Power Technology guarantee extreme power with every hit. Featuring a Soft Comfort Tack Grip and full taper handle, this bat offers unparalleled control and comfort, making it the top choice for elite players in 2026. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-soldier-tank-drip-drop-10-fastpitch-softball-bat-st-s-26-2-10",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/s/t/st-s-26-2-10.jpg",
  "warranty": "Length to Weight Ratio: Drop 10",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/s/t/st-s-26-2-10.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-soldier-tank-drip-drop-10-fastpitch-softball-bat-st-s-26-2-10_1.jpg"
  ],
  "category_path": [
    "Bats",
    "Softball Bats",
    "Fastpitch Bats"
  ],
  "features": [
    "Delivery: Fast & Free Shipping",
    "Warranty: Full 1-Year through the manufacturer",
    "Length to Weight Ratio: Drop 10",
    "Certification: USSSA 1.20, ISA, WBSC, NSA, & USA Softball (ASA)",
    "Swing Feel: Balanced",
    "Bat Material: 2-Piece Composite",
    "Barrel Diameter: 2 3/4 Inch",
    "Colorway: Black, Pink, & Multi",
    "Hitter Type: Contact & Power",
    "7312 Trampoline Composite: Adds pop using accelerated spacers",
    "Infused Power Tech: Enlarged sweet spot",
    "Power Connector: Creates extreme whip",
    "Full Taper Handle: Maximizes control & reduces hand sting",
    "End Cap: Carbon fiber speed"
  ]
}