{
  "name": "h3",
  "price": 399.95,
  "description": "Unleash your potential with the 2026 DeMarini The Goods \"Royal Purple\" BBCOR Baseball Bat, a top choice for power hitters seeking unrivaled performance. This bat features a striking high-gloss Purple & Teal X14 Alloy Barrel, designed to deliver massive power and accuracy with every swing. The revamped 1375 Composite Handle, paired with the new Upgraded Direct Connection, ensures a durable and stiff feel, allowing for powerful hits without compromising comfort. With its end-loaded swing feel and Tremor End Cap, this bat is engineered for extreme durability and optimized power, making it the ultimate weapon for elite high school and college players. Backed by DeMarini’s Expanded BBCOR Warranty, The Goods Royal Purple is a testament to superior craftsmanship and performance. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-demarini-the-goods-royal-purple-bbcor-baseball-bat-wbd2634010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2634010.jpg",
  "warranty": "Length to Weight Ratio: Drop 3",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2634010.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-demarini-the-goods-royal-purple-bbcor-baseball-bat-wbd2634010_1.jpg"
  ],
  "category_path": [
    "Bats",
    "2026 DeMarini The Goods \"Royal Purple\" BBCOR Baseball Bat: WBD2634010"
  ],
  "features": [
    "D elivery: Fast & Free Shipping on all orders",
    "Warranty: Full 1-year through the manufacturer",
    "Length to Weight Ratio: Drop 3",
    "Certification: BBCOR Certified",
    "Bat Series: The Goods",
    "Swing Feel: End-loaded",
    "Bat Material: 2-piece hybrid (Composite handle & alloy barrel)",
    "Barrel Diameter: 2 5/8 Inch",
    "Colorway: Purple, teal, & black",
    "Designed For: Unmatched durability & premium pop",
    "Upgraded Direct Connection: Improves durability & maintains forgiveness",
    "Tremor End Cap: Provides extreme durability & optimizes power",
    "X14 Alloy Barrel: Massive barrel for improved accuracy",
    "1375 Composite Handle: Thicker composite for more power"
  ]
}