{
  "name": "h3",
  "price": 349.99,
  "description": "Unleash your boldest swings with the 2026 Easton MAV1 Flash BBCOR Bat, designed to electrify the field with explosive energy and vibrant style. This high-performance bat is tailored for hitters seeking a perfect balance of speed and control, featuring a 2 5/8-inch barrel diameter and a drop 3 length-to-weight ratio. Its standout Flashpoint Alloy enhances swing speed and barrel performance, while the innovative WaveWall Technology optimizes performance across a larger hitting surface. The Gen2 IN2UITY Feel Soft Knob and Flow-Tack Grip provide superior comfort and control, reducing vibration for a smooth swing path. Finished in a striking peach, pink, purple, and blue colorway, this BBCOR .50 certified bat is ready to dominate high school, college, and select Little League divisions, all backed by a 12-month warranty. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-easton-mav1-flash-bbcor-bat-ebb6m1f3",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/e/b/ebb6m1f3.jpg",
  "warranty": "Length to Weight Ratio: Drop 3",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/e/b/ebb6m1f3.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-easton-mav1-flash-bbcor-bat-ebb6m1f3_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 3",
    "Certification: BBCOR",
    "Swing Feel: Balanced",
    "Bat Material: One-Piece Alloy",
    "Barrel Diameter: 2 5/8 Inch",
    "Color: Peach Gradient & Blue",
    "Flashpoint Alloy: Ultra-Balanced Swing Weight",
    "Wavewall Technology: Optimized barrel wall for better results on mis-hits",
    "Gen2 IN2UITY Soft Feel Knob: Asymmetric contour for max comfort & control"
  ]
}