{
  "name": "h3",
  "price": 349.99,
  "description": "The 2026 Rawlings Icon Drop 12 USA Baseball Bat is engineered for players seeking a balanced swing with a powerful performance. Certified by USA Baseball, this bat features a 2 5/8 inch barrel diameter and is crafted from a 2-piece composite, making it ideal for both contact and power hitters. Its eye-catching mint and black colorway houses advanced technologies like the In/Tense Carbon Composite, which optimizes barrel performance and enhances the trampoline effect. With Zero Loss Energy Technology to reduce drag and hand vibration, and Tuned Balanced Performance that adjusts to each batter's swing, the bat ensures superior control and comfort. Additionally, the RevGrip provides excellent tack and cushioning, making it a standout choice for players looking to elevate their game. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-rawlings-icon-drop-12-usa-baseball-bat-rus6i12",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/r/u/rus6i12.jpg",
  "warranty": "Length to Weight Ratio: Drop 12 (-12)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/r/u/rus6i12.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-rawlings-icon-drop-12-usa-baseball-bat-rus6i12_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: Fast & Free Shipping on all orders",
    "Warranty: Full 1-year through the manufacturer",
    "Length to Weight Ratio: Drop 12 (-12)",
    "Certification: USA Baseball Certified",
    "Swing Feel: Balanced",
    "Bat Material: 2-Piece Composite",
    "Barrel Diameter: 2 5/8 Inch",
    "Hitting Style: Contact & power hitters alike",
    "Colorway: Mint & black",
    "In/Tense Carbon Composite: Optimizes barrel performance & enhances trampoline effect",
    "Zero Loss Energy Technology: Reduces drag & hand vibration",
    "Tuned Balanced Performance: Adjusts to each batter's swing",
    "RevGrip: Equips superior tack & cushioning"
  ]
}