{
  "name": "h3",
  "price": 334.99,
  "description": "Introducing the game-changing 2026 Soldier Tank Drip USSSA Drop 8 Baseball Bat, designed with an enormous barrel profile and an ultra-hot, widened sweet spot for unparalleled power. Developed by expert hitters and genius engineers, this bat combines a light swing weight with explosive power, thanks to its innovative aerodynamic connector and carbon fiber speed end cap. Experience extreme whip and unmatched durability, making every hit feel like a trampoline bounce. Perfect for both power and contact hitters, its soft comfort tack grip and tapered handle ensure control and reduce hand ringing. As the official metal bat of Perfect Game, this bat promises to be even hotter than the 2025 model, offering the ultimate speed, mass, and impact for any player looking to dominate the field. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-soldier-tank-drip-usssa-drop-8-baseball-bat-st-y-26-2-8",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/s/t/st-y-26-2-8.jpg",
  "warranty": "Length to Weight Ratio: Drop 8",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/s/t/st-y-26-2-8.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-soldier-tank-drip-usssa-drop-8-baseball-bat-st-y-26-2-8_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: Fast & Free Shipping",
    "Warranty: Full 1-Year through the manufacturer",
    "Length to Weight Ratio: Drop 8",
    "Certification: USSSA 1.15",
    "Swing Feel: Balanced",
    "Bat Material: 2-Piece Composite",
    "Barrel Diameter: 2 3/4 Inch",
    "Colorway: Green, Black, & Multi",
    "Hitter Type: Contact & Power",
    "7312 Trampoline Composite: Adds pop using accelerated spacers",
    "Infused Power Tech: Enlarged sweet spot",
    "Aerodynamic Connector: Creates extreme whip & durability",
    "Full Taper Handle: Maximizes control & reduces hand sting",
    "End Cap: Carbon fiber speed"
  ]
}