{
  "name": "h3",
  "price": 399.99,
  "description": "The 2026 Marucci CATX RCKLESS Hybrid BBCOR Baseball Bat is designed to elevate your game with its innovative features and striking colorway of black, neon green, and sky blue. This balanced bat boasts a drop 3 length-to-weight ratio and a 2 5/8 inch barrel diameter, making it BBCOR .50 certified for top-notch performance. Its two-piece hybrid construction includes a ring-free barrel design that enhances barrel flex and overall production, while the OLS connection offers the stiffest link to minimize vibrations for smooth swings. The AZR Alloy and multi-variable wall design expand the sweet spot, ensuring optimal plate performance and responsiveness. The bat's PFX Composite Handle, custom knob design, and enhanced soft touch grip work together to boost speed, power, and control, making it an ideal choice for serious players. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-marucci-catx-rckless-hybrid-bbcor-baseball-bat-mcbcrh",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/c/mcbcrh.jpg",
  "warranty": "Length to Weight Ratio: Drop 3 (-3)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/c/mcbcrh.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-marucci-catx-rckless-hybrid-bbcor-baseball-bat-mcbcrh_1.jpg"
  ],
  "category_path": [
    "Bats",
    "2026 Marucci CATX RCKLESS Hybrid BBCOR Baseball Bat: MCBCRH"
  ],
  "features": [
    "Delivery: Free & Fast Shipping on all orders",
    "Warranty: Full twelve (12) months through the manufacturer",
    "Length to Weight Ratio: Drop 3 (-3)",
    "Certification: BBCOR .50 Certified",
    "Barrel Diameter: 2 5/8 Inch",
    "Swing Feel: Balanced",
    "Bat Material: Two-piece Hybrid",
    "Colorway: Black, Neon Green, & Sky Blue",
    "Ring-Free Barrel Construction: Enhances barrel flex & overall bat production",
    "OLS Connection: Stiffest connection that reduces vibrations for smooth swings",
    "AZR Alloy: Ensures optimal plate performance & bat responsiveness",
    "Multi-Variable Wall Design: Expanded sweet spot w/ forgiving barrel walls",
    "TFX End Cap: Softer end cap increases forgiveness",
    "PFX Composite Handle: Engineered by bat drop enhancing speed, power, & feel",
    "Custom Knob Design: Optimized knob shape for each drop for better feel",
    "Enhanced Soft Touch Grip: Enhances feel & control"
  ]
}