{
  "name": "h3",
  "price": 79.99,
  "description": "The 2026 Marucci CATX RCKLESS Red Drop 11 USA Tee Ball Bat is designed to elevate young players' performance with its advanced features and striking colorway of red, sky blue, and black. This bat boasts a balanced swing feel, making it perfect for developing a smooth and controlled swing. Its one-piece alloy construction, combined with a 2 5/8 inch barrel diameter, ensures durability and optimal performance on the field. The ring-free barrel construction enhances barrel flex and overall production, while the TFX end cap provides increased forgiveness. Additionally, the enhanced soft touch grip offers superior feel and control, making it a top choice for aspiring tee ball players. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-marucci-catx-rckless-red-drop-11-usa-tee-ball-bat-mtbcrr",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/t/mtbcrr.jpg",
  "warranty": "Length to Weight Ratio: Drop 11 (-11)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/t/mtbcrr.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-marucci-catx-rckless-red-drop-11-usa-tee-ball-bat-mtbcrr_1.jpg"
  ],
  "category_path": [
    "Bats",
    "2026 Marucci CATX RCKLESS Red Drop 11 USA Tee Ball Bat: MTBCRR"
  ],
  "features": [
    "Delivery: Free & Fast Shipping on all orders",
    "Warranty: Full twelve (12) months through the manufacturer",
    "Length to Weight Ratio: Drop 11 (-11)",
    "Certification: USA Baseball Certified",
    "Barrel Diameter: 2 5/8 Inch",
    "Swing Feel: Balanced",
    "Bat Material: One-piece alloy",
    "Colorway: Red, sky blue, & black",
    "Ring-Free Barrel Construction: Enhances barrel flex & overall bat production",
    "TFX End Cap: Softer end cap increases forgiveness",
    "Enhanced Soft Touch Grip: Enhances feel & control"
  ]
}