{
  "name": "h3",
  "price": 69.95,
  "description": "Introducing the 2026 Victus Vibe Pro-Crayon Tatis Pink Drop 11 USA Tee Ball Bat, a must-have for young players looking to enhance their game. This USA-certified bat features a mid-balanced swing feel, making it perfect for aspiring athletes. Crafted with a one-piece alloy composite and a 2 5/8 inch barrel diameter, it boasts a striking purple and blue colorway. The bat showcases Fernando Tatis Jr.'s authentic signature on the barrel, adding a touch of star power. Equipped with an ergonomic handle taper for superior bat control and feel, the VXP Alloy construction enhances pop and extends durability, while the ringless barrel design offers a thinner, more flexible sweet spot for improved performance. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-victus-vibe-pro-crayon-tatis-pink-drop-11-usa-tee-ball-bat-vtbvibc-ft",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/v/t/vtbvibc-ft.jpg",
  "warranty": "Length to Weight Ratio: Drop 11",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/v/t/vtbvibc-ft.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-victus-vibe-pro-crayon-tatis-pink-drop-11-usa-tee-ball-bat-vtbvibc-ft_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on ALL Orders",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 11",
    "Certification: USA Certified",
    "Swing Feel: Mid-Balanced",
    "Bat Material: One-Piece Alloy Composite",
    "Barrel Diameter: 2 5/8 Inch",
    "Colorway: Purple & Blue",
    "Authentic Signature: Fernando Tatis Jr. Signature on Barrel",
    "Ergonomic Handle Taper: More Bat Control & Feel",
    "VXP Alloy: Increase Pop & Extended Durability",
    "Ringless Barrel Construction: Creates a Thinner, More Flexible Sweet Spot"
  ]
}