{
  "name": "h3",
  "price": 299.95,
  "description": "The 2026 Louisville Slugger Select PWR Drop 10 USA Baseball Bat is a standout choice for players seeking optimal performance on the field. With its balanced swing feel, this bat ensures ultimate barrel control and power, making it perfect for both contact and power hitters. Its vibrant neon yellow, red, and black colorway is as striking as its performance, thanks to the massive sweet spot provided by the EXD Alloy Barrel. The VCX3 Connection technology reduces hand sting while maintaining excellent feedback, and the SPD-Gen2 End Cap enhances barrel performance. Featuring a Premium PRO Comfort Grip, this bat offers superior tack and cushion for an unmatched feel in every swing. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-louisville-slugger-select-pwr-drop-10-usa-baseball-bat-wbl4126010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl4126010.jpg",
  "warranty": "Length to Weight Ratio: Drop 10",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl4126010.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-louisville-slugger-select-pwr-drop-10-usa-baseball-bat-wbl4126010_1.jpg"
  ],
  "category_path": [
    "Bats",
    "2026 Louisville Slugger Select PWR Drop 10 USA Baseball Bat: WBL4126010",
    "Baseball Bats",
    "Youth Baseball Bats"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on all orders",
    "Warranty: Full 1-year through the manufacturer",
    "Length to Weight Ratio: Drop 10",
    "Certification: USA Baseball Certified",
    "Swing Feel: Balanced",
    "Bat Material: Two-piece hybrid - Alloy barrel & composite handle",
    "Barrel Diameter: 2 5/8 Inch",
    "Bat Series: Select PWR",
    "Colorway: Neon yellow, red, & black",
    "EXD Alloy Barrel: Equips huge sweet spot with premium pop",
    "VCX3 Connection: Minimizes hand sting while providing feedback",
    "SPD-Gen2 End Cap: Designed to maximize barrel performance",
    "Balanced Swing Weight: For ultimate barrel control & power",
    "Premium PRO Comfort Grip: Superior tack & cushion"
  ]
}