{
  "name": "h3",
  "price": 279.99,
  "description": "The 2026 Marucci CATX Reckless Drop 10 USSSA Baseball Bat is engineered for players seeking unparalleled performance and comfort at the plate. Featuring a balanced swing feel and a robust one-piece alloy construction, this bat is USSSA 1.15 BPF certified with a 2 3/4 inch barrel diameter. Its AZR Alloy delivers optimal performance and responsiveness, while the ring-free barrel construction enhances barrel flex and production. The bat's AV3 Vibration Dampener and multi-variable wall design ensure a comfortable grip and expanded sweet spot, complemented by a TFX End Cap and custom knob design for enhanced forgiveness and control. In its striking black, sky blue, and red colorway, this bat is designed to stand out both in style and performance. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-marucci-catx-reckless-drop-10-usssa-baseball-bat-msbcr10",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcr10.jpg",
  "warranty": "Length to Weight Ratio: Drop 10 (-10)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcr10.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-marucci-catx-reckless-drop-10-usssa-baseball-bat-msbcr10_1.jpg"
  ],
  "category_path": [
    "Bats",
    "2026 Marucci CATX RCKLESS Drop 10 USSSA Baseball Bat: MSBCR10"
  ],
  "features": [
    "Delivery: Free & Fast Shipping on all orders",
    "Warranty: Full twelve (12) months through the manufacturer",
    "Length to Weight Ratio: Drop 10 (-10)",
    "Certification: USSSA 1.15 BPF Certified",
    "Barrel Diameter: 2 3/4 Inch",
    "Swing Feel: Balanced",
    "Bat Material: One-piece alloy",
    "Colorway: Black, Sky Blue, & Red",
    "Ring-Free Barrel Construction: Enhances barrel flex & overall bat production",
    "AZR Alloy: Ensures optimal plate performance & bat responsiveness",
    "AV3 Vibration Dampener: Absorbs vibrations & sting for feel & comfort",
    "Multi-Variable Wall Design: Expanded sweet spot w/ forgiving barrel walls",
    "TFX End Cap: Softer end cap increases forgiveness",
    "Custom Knob Design: Optimized knob shape for each drop for better feel",
    "Enhanced Soft Touch Grip: Enhances feel & control"
  ]
}