{
  "name": "h3",
  "price": 334.99,
  "description": "Introducing the 2026 Soldier Tank Drip USSSA Drop 10 Baseball Bat, the pinnacle of innovation and performance for serious hitters. Featuring an ENORMOUS barrel profile and a game-changing, significantly widened sweet spot, this bat is scientifically developed by real hitters and genius-level engineers to deliver unmatched power and a light swing weight. Its new aerodynamic connector enhances whip and durability, making it the official metal bat of Perfect Game. With infused power technology and a new carbon fiber speed end cap, this bat is built for both power and contact hitters, offering a soft comfort tack grip and a full taper for increased control. Experience extreme power and speed, even on miss-hits, with a bat that's hotter than ever and designed to dominate the field. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-soldier-tank-drip-usssa-drop-10-baseball-bat-st-y-26-2-10",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/s/t/st-y-26-2-10.jpg",
  "warranty": "Length to Weight Ratio: Drop 10",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/s/t/st-y-26-2-10.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-soldier-tank-drip-usssa-drop-10-baseball-bat-st-y-26-2-10_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: Fast & Free Shipping",
    "Warranty: Full 1-Year through the manufacturer",
    "Length to Weight Ratio: Drop 10",
    "Certification: USSSA 1.15",
    "Swing Feel: Balanced",
    "Bat Material: 2-Piece Composite",
    "Barrel Diameter: 2 3/4 Inch",
    "Colorway: Green, Black, & Multi",
    "Hitter Type: Contact & Power",
    "7312 Trampoline Composite: Adds pop using accelerated spacers",
    "Infused Power Tech: Enlarged sweet spot",
    "Aerodynamic Connector: Creates extreme whip & durability",
    "Full Taper Handle: Maximizes control & reduces hand sting",
    "End Cap: Carbon fiber speed"
  ]
}