{
  "name": "h3",
  "price": 499.99,
  "description": "Unleash your potential with the 2026 Easton Dub Drop 10 USSSA Baseball Bat, designed for players who infuse energy and confidence into every swing. Featuring Easton's innovative Double Barrel technology, this bat boasts the lowest barrel compression in the USSSA lineup, enhancing barrel flex and delivering elite performance across its entire length. Its two-piece composite construction minimizes vibration and maximizes barrel flex, while the ConneXion Max elastomer connection piece ensures smooth, powerful contact even on mishits. The Optiflex handle is engineered for perfect balance, offering improved barrel control and raw power, making it ideal for elite athletes seeking to boost their bat speed and performance. Stand out on the field with the Easton Dub, your ultimate tool for turning every swing into a statement. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-easton-dub-drop-10-usssa-baseball-bat-eut6dub10",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/e/u/eut6dub10_12.jpg",
  "warranty": "Length to Weight Ratio: Drop 10",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/e/u/eut6dub10_12.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-easton-dub-drop-10-usssa-baseball-bat-eut6dub10_1.jpg"
  ],
  "category_path": [
    "Bats",
    "2026 Easton Dub Drop 10 USSSA Baseball Bat: EUT6DUB10"
  ],
  "features": [
    "X1 Bat Per Household: Due to High Demand",
    "D elivery: FAST & FREE shipping",
    "Warranty: Full 1-Year through the manufacturer",
    "Length to Weight Ratio: Drop 10",
    "Certification: USSSA certified",
    "Swing Feel: Barrel-Loaded",
    "Bat Material: Two-piece composite",
    "Barrel Diameter: 2 3/4 Inch",
    "Colorway: White, Yellow, & Pink",
    "Bat Series: Dub",
    "Hitting Style: Contact & power hitter",
    "Double Barrel: Increased flex & elite performance across the barrel",
    "ConneXion Max Connector: Smooth & powerful contact",
    "OptiFlex Handle: Provides perfect balance of stiffness & flex"
  ]
}