{
  "name": "h3",
  "price": 279.99,
  "description": "The 2026 Marucci CATX Reckless Drop 8 USSSA Baseball Bat is designed for players seeking a blend of power and precision. Certified with the USSSA 1.15 BPF, this bat features a balanced swing feel and a 2 3/4 inch barrel diameter, making it a formidable choice on the field. Its innovative ring-free barrel construction enhances barrel flex and overall production, while the AZR Alloy ensures optimal plate performance and responsiveness. With the AV3 Vibration Dampener, players experience reduced vibrations and sting, complemented by a multi-variable wall design that offers an expanded sweet spot. The bat's sleek colorway in black, sky blue, and red, alongside features like the TFX End Cap and custom knob design, provides an exceptional feel and control, making it a top choice for serious athletes. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-marucci-catx-reckless-drop-8-usssa-baseball-bat-msbcr8",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcr8.jpg",
  "warranty": "Length to Weight Ratio: Drop 8 (-8)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcr8.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-marucci-catx-reckless-drop-8-usssa-baseball-bat-msbcr8_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: Free & Fast Shipping on all orders",
    "Warranty: Full twelve (12) months through the manufacturer",
    "Length to Weight Ratio: Drop 8 (-8)",
    "Certification: USSSA 1.15 BPF Certified",
    "Barrel Diameter: 2 3/4 Inch",
    "Swing Feel: Balanced",
    "Bat Material: One-piece alloy",
    "Colorway: Black, Sky Blue, & Red",
    "Ring-Free Barrel Construction: Enhances barrel flex & overall bat production",
    "AZR Alloy: Ensures optimal plate performance & bat responsiveness",
    "AV3 Vibration Dampener: Absorbs vibrations & sting for feel & comfort",
    "Multi-Variable Wall Design: Expanded sweet spot w/ forgiving barrel walls",
    "TFX End Cap: Softer end cap increases forgiveness",
    "Custom Knob Design: Optimized knob shape for each drop for better feel",
    "Enhanced Soft Touch Grip: Enhances feel & control"
  ]
}