{
  "name": "h3",
  "price": 349.99,
  "description": "Introducing the 2026 Marucci CATX RCKLESS Hybrid Drop 10 USSSA Baseball Bat, a game-changer for young sluggers seeking top-tier performance. This bat boasts a slightly end-loaded swing feel, thanks to its innovative two-piece hybrid construction and AZR Alloy, which ensures optimal plate performance and responsiveness. The 2 3/4 inch barrel diameter is enhanced by a ring-free barrel construction, offering improved barrel flex and overall production. With a USSSA 1.15 BPF certification, this bat also features a multi-variable wall design for an expanded sweet spot and forgiving barrel walls. Its black, neon green, and sky blue colorway is complemented by an OLS Connection, reducing vibrations for smooth swings, and a PFX Composite Handle designed for speed, power, and feel. The TFX End Cap and custom knob design further enhance forgiveness and control, while the enhanced soft touch grip provides superior feel and control at the plate. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-marucci-catx-rckless-hybrid-drop-10-usssa-baseball-bat-msbcrh10",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcrh10.jpg",
  "warranty": "Length to Weight Ratio: Drop 10 (-10)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcrh10.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-marucci-catx-rckless-hybrid-drop-10-usssa-baseball-bat-msbcrh10_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: Free & Fast Shipping on all orders",
    "Warranty: Full twelve (12) months through the manufacturer",
    "Length to Weight Ratio: Drop 10 (-10)",
    "Certification: USSSA 1.15 BPF Certified",
    "Barrel Diameter: 2 3/4 Inch",
    "Swing Feel: Slightly end-loaded",
    "Bat Material: Two-piece hybrid",
    "Colorway: Black, neon green, & sky blue",
    "Ring-Free Barrel Construction: Enhances barrel flex & overall bat production",
    "OLS Connection: Stiffest connection that reduces vibrations for smooth swings",
    "AZR Alloy: Ensures optimal plate performance & bat responsiveness",
    "Multi-Variable Wall Design: Expanded sweet spot w/ forgiving barrel walls",
    "TFX End Cap: Softer end cap increases forgiveness",
    "PFX Composite Handle: Engineered by bat drop enhancing speed, power, & feel",
    "Custom Knob Design: Optimized knob shape for each drop for better feel",
    "Enhanced Soft Touch Grip: Enhances feel & control"
  ]
}