{
  "name": "h3",
  "price": 299.99,
  "description": "The 2026 Marucci CATX RCKLESS Composite JBB Drop 10 Baseball Bat is meticulously crafted for young players aiming to elevate their game. With a drop 10 length-to-weight ratio and a balanced swing feel, this bat offers the perfect balance for power hitters. Its USSSA 1.15 BPF certification ensures compliance and top-tier performance on the field. The two-piece composite construction, featuring a FLEX Composite Barrel and PFX Composite Handle, delivers maximum performance, speed, and responsiveness. The bat's sleek black, teal, and purple colorway is complemented by advanced technologies like the OLS Connection for reduced vibrations and a TFX End Cap for increased forgiveness, while the ring-free barrel construction enhances overall production. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-marucci-catx-rckless-composite-jbb-drop-10-baseball-bat-mjbbcrc",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/j/mjbbcrc.jpg",
  "warranty": "Length to Weight Ratio: Drop 10 (-10)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/j/mjbbcrc.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-marucci-catx-rckless-composite-jbb-drop-10-baseball-bat-mjbbcrc_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: Free & Fast Shipping on all orders",
    "Warranty: Full twelve (12) months through the manufacturer",
    "Length to Weight Ratio: Drop 10 (-10)",
    "Certification: USSSA 1.15 BPF Certified",
    "Barrel Diameter: 2 3/4 Inch",
    "Swing Feel: Balanced",
    "Bat Material: Two-piece composite",
    "Colorway: Black, teal, & purple",
    "Ring-Free Barrel Construction: Enhances barrel flex & overall bat production",
    "FLEX Composite Barrel: Ensures max performance & barrel responsiveness",
    "OLS Connection: Stiffest connection that reduces vibrations for smooth swings",
    "TFX End Cap: Softer end cap increases forgiveness",
    "PFX Composite Handle: Engineered by bat drop enhancing speed, power, & feel",
    "Custom Knob Design: Optimized knob shape for each drop for better feel",
    "Enhanced Soft Touch Grip: Enhances feel & control"
  ]
}