{
  "name": "h3",
  "price": 249.95,
  "description": "The 2026 DeMarini The Goods Drop 10 USA Baseball Bat is designed for players seeking a balanced swing feel and optimal performance. Certified by USA Baseball, this bat features a two-piece hybrid construction with an X14 Alloy Barrel, offering a huge sweet spot that caters to both contact and power hitters. Its 2 5/8-inch barrel diameter is complemented by a Direct Connection system, ensuring a stiff yet comfortable feel for enhanced responsiveness. The vibrant colorway of yellow, red, and black is matched by a Tracer End Cap, which boosts bat speed for maximum barrel performance. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-demarini-the-goods-drop-10-usa-baseball-bat-wbd2601010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2601010.jpg",
  "warranty": "Length to Weight Ratio: Drop 10",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2601010.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-demarini-the-goods-drop-10-usa-baseball-bat-wbd2601010_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on all orders",
    "Warranty: Full 1-Year through the manufacturer",
    "Length to Weight Ratio: Drop 10",
    "Certification: USA Baseball",
    "Swing Feel: Balanced",
    "Bat Material: Two-piece hybrid (Alloy Barrel & Composite Handle)",
    "Barrel Diameter: 2 5/8 Inch",
    "Bat Series: The Goods",
    "Hitting Style: Contact & Power Hitters",
    "Colorway: Yellow, Red, & Black",
    "X14 Alloy Barrel: Provides a huge sweet spot for easy swinging",
    "Direct Connection: Stiff yet comfortable feel for responsiveness",
    "Tracer End Cap: Enhances bat speed for max barrel performance"
  ]
}