{
  "name": "h3",
  "price": 249.99,
  "description": "The 2026 Marucci CATX RCKLESS Hybrid Drop 11 USA Baseball Bat is a game-changer for young players seeking to elevate their performance on the field. With its slightly end-loaded swing feel, this bat offers a perfect blend of speed and power, thanks to its innovative two-piece hybrid construction. The AZR Alloy and multi-variable wall design create an expanded sweet spot, ensuring optimal plate performance and bat responsiveness, while the SDX LT2 connection effectively dampens vibrations for smooth, controlled swings. The eye-catching colorway of sky blue, neon green, and black is matched by advanced features such as the ring-free barrel construction for enhanced flex, a custom knob design for improved feel, and an enhanced soft touch grip for superior control. This USA Baseball Certified bat is ready to make a statement on the field with its 2 5/8-inch barrel diameter and TFX end cap for increased forgiveness. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-marucci-catx-rckless-hybrid-drop-11-usa-baseball-bat-msbcrh11usa",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcrh11usa.jpg",
  "warranty": "Length to Weight Ratio: Drop 11 (-11)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcrh11usa.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-marucci-catx-rckless-hybrid-drop-11-usa-baseball-bat-msbcrh11usa_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: Free & Fast Shipping on all orders",
    "Warranty: Full twelve (12) months through the manufacturer",
    "Length to Weight Ratio: Drop 11 (-11)",
    "Certification: USA Baseball Certified",
    "Barrel Diameter: 2 5/8 Inch",
    "Swing Feel: Slightly end-loaded",
    "Bat Material: Two-piece hybrid",
    "Colorway: Sky blue, neon green, & black",
    "Ring-Free Barrel Construction: Enhances barrel flex & overall bat production",
    "SDX LT2 Connection: Kills vibrations for smooth, controlled swings",
    "AZR Alloy: Ensures optimal plate performance & bat responsiveness",
    "Multi-Variable Wall Design: Expanded sweet spot w/ forgiving barrel walls",
    "TFX End Cap: Softer end cap increases forgiveness",
    "PFX Composite Handle: Engineered by bat drop enhancing speed, power, & feel",
    "Custom Knob Design: Optimized knob shape for each drop for better feel",
    "Enhanced Soft Touch Grip: Enhances feel & control"
  ]
}