{
  "name": "h3",
  "price": 199.99,
  "description": "The 2026 Marucci CATX RCKLESS Drop 8 USA Baseball Bat is a game-changer for young athletes seeking superior performance on the field. With its USA Baseball Certification and a balanced swing feel, this bat is designed for optimal play. The one-piece alloy construction, featuring the innovative AZR Alloy, ensures exceptional plate performance and responsiveness. Its ring-free barrel construction and multi-variable wall design expand the sweet spot, while the AV3 Vibration Dampener absorbs vibrations for enhanced comfort. The bat's vibrant red, black, and sky blue colorway, coupled with a custom knob design and soft touch grip, provide both style and control for players aiming for excellence. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-marucci-catx-rckless-drop-8-usa-baseball-bat-msbcr8usa",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcr8usa.jpg",
  "warranty": "Length to Weight Ratio: Drop 8 (-8)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcr8usa.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-marucci-catx-rckless-drop-8-usa-baseball-bat-msbcr8usa_1.jpg"
  ],
  "category_path": [
    "Bats",
    "2026 Marucci CATX RCKLESS Drop 8 USA Baseball Bat: MSBCR8USA"
  ],
  "features": [
    "Delivery: Free & Fast Shipping on all orders",
    "Warranty: Full twelve (12) months through the manufacturer",
    "Length to Weight Ratio: Drop 8 (-8)",
    "Certification: USA Baseball Certified",
    "Barrel Diameter: 2 5/8 Inch",
    "Swing Feel: Balanced",
    "Bat Material: One-piece alloy",
    "Colorway: Red, black, & sky blue",
    "Ring-Free Barrel Construction: Enhances barrel flex & overall bat production",
    "AZR Alloy: Ensures optimal plate performance & bat responsiveness",
    "AV3 Vibration Dampener: Absorbs vibrations & sting for feel & comfort",
    "Multi-Variable Wall Design: Expanded sweet spot w/ forgiving barrel walls",
    "TFX End Cap: Softer end cap increases forgiveness",
    "Custom Knob Design: Optimized knob shape for each drop for better feel",
    "Enhanced Soft Touch Grip: Enhances feel & control"
  ]
}