{
  "name": "h3",
  "price": 349.95,
  "description": "Introducing the 2026 Louisville Slugger Omaha BBCOR Baseball Bat, engineered for power hitters seeking superior performance. This end-loaded bat features a one-piece alloy construction with a 2 5/8 inch barrel diameter, offering an optimized wall design thanks to advanced AI simulations. The EVOKE Alloy Barrel, paired with the XPND End Cap, ensures maximum barrel performance, while the Tuned Mass Damper significantly reduces hand vibration for a smoother swing. With a drop 3 length-to-weight ratio, this BBCOR .50 Certified bat is perfect for high school and college play. The sleek black and green colorway, combined with the Premium LS Pro Comfort Grip and Pro Design Knob Taper, enhances comfort, control, and leverage, making it a top choice for serious athletes. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-louisville-slugger-omaha-bbcor-baseball-bat-wbl4117010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl4117010.jpg",
  "warranty": "Length to Weight Ratio: Drop 3 (-3)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl4117010.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-louisville-slugger-omaha-bbcor-baseball-bat-wbl4117010_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on all orders",
    "Warranty: Full 1-year through the manufacturer",
    "Length to Weight Ratio: Drop 3 (-3)",
    "Certification: BBCOR .50 Certified",
    "Swing Feel: End-loaded",
    "Bat Material: One-piece alloy",
    "Barrel Diameter: 2 5/8 Inch",
    "Hitting Style: Power hitters",
    "Colorway: Green, Cream, & Black",
    "EVOKE Alloy Barrel: Optimized wall design by Ai simulations",
    "Tuned Mass Damper: Reduces hand vibration",
    "XPND End Cap: Maximizes barrel performance",
    "Premium LS Pro Comfort Grip: Superior tack & cushion",
    "Pro Design Knob Taper: Improves comfort, control & leverage",
    "Approved For: High school & college play"
  ]
}