{
  "name": "h3",
  "price": 349.99,
  "description": "The 2026 Easton Hype Fire Drop 5 USA Baseball Bat is a game-changer for serious players seeking a balanced swing feel. Certified by USA Baseball, this two-piece composite bat features a 2 3/4 inch barrel diameter and showcases a striking green, yellow, and pink colorway. Designed for both contact and power hitters, it boasts a 3D Ropecoil Composite that wraps 360° around the barrel’s sweet spot, enhancing performance across the entire barrel. The Connexion Max elastomer connector minimizes vibrations for an optimal feel, while the Opti-Flex Handle is tailored for elite travel ball athletes. Enhanced with a Flow Tack grip and Power Boost Soft knob, this bat ensures exceptional comfort, feel, and control. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-easton-hype-fire-drop-5-usa-baseball-bat-eus6hyp5",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/e/u/eus6hyp5.jpg",
  "warranty": "Length to Weight Ratio: Drop 5 (-5)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/e/u/eus6hyp5.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-easton-hype-fire-drop-5-usa-baseball-bat-eus6hyp5_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 5 (-5)",
    "Certification: USA Baseball Certified",
    "Swing Feel: Balanced",
    "Bat Material: Two-Piece Composite",
    "Barrel Diameter: 2 5/8 Inch",
    "Colorway: Green, yellow, & pink",
    "Bat Series: Hype Fire",
    "Hitting Style: Contact & Power Hitter",
    "3D Ropecoil Composite : 3D Composite rope wrapped 360° around the barrel’s sweet spot to expand performance across the entire barrel",
    "Connexion Max : Elastomer connector to eliminate vibration for optimal feel",
    "Opti-Flex Handle : Engineered by size for elite travel ball athletes",
    "Enhanced Grip & Feel : Flow Tack grip & Power Boost Soft knob for comfort, feel, & control"
  ]
}