{
  "name": "h3",
  "price": 399.95,
  "description": "Step up your game with the 2026 DeMarini Zen Drop 5 USSSA Baseball Bat, designed to deliver exceptional performance on the field. This bat features a balanced swing feel and a 2-piece composite construction, ensuring a powerful and controlled swing every time. With its updated Zen Dark Matter Composite Barrel, players can enjoy a maximized sweet spot for better hits. The Zen Direct Connection provides a forgiving feel, while the Anomaly End Cap reduces swing weight, enhancing barrel performance and control. Certified with the USSSA 1.15 BPF, this bat combines innovation and style with its striking green and black colorway. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-demarini-zen-drop-5-usssa-baseball-bat-wbd2593010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2593010.jpg",
  "warranty": "Length to Weight Ratio: Drop 5 (-5)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2593010.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-demarini-zen-drop-5-usssa-baseball-bat-wbd2593010_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "D elivery: Fast & Free Shipping on all orders",
    "Warranty: Full 1-year through the manufacturer",
    "Length to Weight Ratio: Drop 5 (-5)",
    "Certification: USSSA 1.15 BPF Certified",
    "Swing Feel: Balanced",
    "Bat Material: 2-Piece Composite",
    "Barrel Diameter: 2 3/4 Inch",
    "Colorway: Green & Black",
    "Bat Series: Zen",
    "Dark Matter Composite Barrel: Updated for maximum sweet spot",
    "Zen Direct Connection: Creates a more forgiving feel",
    "Anomaly End Cap: Reduced swing weight for improved barrel performance & control"
  ]
}