{
  "name": "h3",
  "price": 99.99,
  "description": "The 2026 Marucci CATX RCKLESS Composite Drop 13 USA Tee Ball Bat is designed to elevate your young athlete's game with precision and style. Featuring a balanced swing feel, this one-piece composite bat is USA Baseball certified, ensuring top-notch performance on the field. Its 2 5/8 inch barrel diameter, complemented by a ring-free barrel construction, enhances barrel flex and overall production, making every hit count. The custom knob design, tailored for each drop, provides a superior feel, while the enhanced soft-touch grip ensures maximum control. Finished in a striking black, teal, and purple colorway, this bat combines aesthetics with functionality for the perfect tee-ball experience. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-marucci-catx-rckless-composite-drop-13-usa-tee-ball-bat-mtbcrc",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/t/mtbcrc.jpg",
  "warranty": "Length to Weight Ratio: Drop 13 (-13)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/t/mtbcrc.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-marucci-catx-rckless-composite-drop-13-usa-tee-ball-bat-mtbcrc_1.jpg"
  ],
  "category_path": [
    "Bats",
    "2026 Marucci CATX RCKLESS Composite Drop 13 USA Tee Ball Bat: MTBCRC"
  ],
  "features": [
    "Delivery: Free & Fast Shipping on all orders",
    "Warranty: Full twelve (12) months through the manufacturer",
    "Length to Weight Ratio: Drop 13 (-13)",
    "Certification: USA Baseball Certified",
    "Barrel Diameter: 2 5/8 Inch",
    "Swing Feel: Balanced",
    "Bat Material: One-piece composite",
    "Colorway: Black, teal, & purple",
    "Ring-Free Barrel Construction: Enhances barrel flex & overall bat production",
    "Custom Knob Design: Optimized knob shape for each drop for better feel",
    "Enhanced Soft Touch Grip: Enhances feel & control"
  ]
}