{
  "name": "h3",
  "price": 399.99,
  "description": "The 2026 Marucci CATX RCKLESS Composite Drop 10 USSSA Baseball Bat is a game-changer designed for young athletes aiming to up their performance on the field. With a slightly end-loaded swing feel and a 2 3/4 inch barrel diameter, this bat is engineered for power hitters. Its two-piece composite construction includes a FLEX Composite Barrel for maximum performance and responsiveness, while the OLS Connection minimizes vibrations for smooth, comfortable swings. The TFX End Cap provides increased forgiveness, and the PFX Composite Handle enhances speed, power, and feel. A vibrant black, teal, and purple colorway, combined with an enhanced soft touch grip and custom knob design, ensures both style and superior control, making it a top choice for serious players. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-marucci-catx-rckless-composite-drop-10-usssa-baseball-bat-msbcrc10",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcrc10.jpg",
  "warranty": "Length to Weight Ratio: Drop 10 (-10)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcrc10.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-marucci-catx-rckless-composite-drop-10-usssa-baseball-bat-msbcrc10_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: Free & Fast Shipping on all orders",
    "Warranty: Full twelve (12) months through the manufacturer",
    "Length to Weight Ratio: Drop 10 (-10)",
    "Certification: USSSA 1.15 BPF Certified",
    "Barrel Diameter: 2 3/4 Inch",
    "Swing Feel: Slightly end-loaded",
    "Bat Material: Two-piece composite",
    "Colorway: Black, teal, & purple",
    "Ring-Free Barrel Construction: Enhances barrel flex & overall bat production",
    "FLEX Composite Barrel: Ensures max performance & barrel responsiveness",
    "OLS Connection: Stiffest connection that reduces vibrations for smooth swings",
    "TFX End Cap: Softer end cap increases forgiveness",
    "PFX Composite Handle: Engineered by bat drop enhancing speed, power, & feel",
    "Custom Knob Design: Optimized knob shape for each drop for better feel",
    "Enhanced Soft Touch Grip: Enhances feel & control"
  ]
}