{
  "name": "h3",
  "price": 349.99,
  "description": "The 2026 Marucci CATX RCKLESS Composite Drop 10 USA Baseball Bat is designed for players seeking a powerful and responsive swing. With a drop 10 length-to-weight ratio and a slightly end-loaded swing feel, this bat offers a perfect balance of speed and power. Its 2 3/4-inch barrel diameter, combined with a FLEX Composite Barrel, ensures maximum performance and responsiveness on every hit. The OLS Connection minimizes vibrations for smooth swings, while the TFX End Cap provides increased forgiveness. Featuring a striking black, teal, and purple colorway, this USA Baseball Certified bat also includes a PFX Composite Handle and Custom Knob Design for enhanced speed, power, and feel. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-marucci-catx-rckless-composite-drop-10-usa-baseball-bat-msbcrc10usa",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcrc10usa.jpg",
  "warranty": "Length to Weight Ratio: Drop 10 (-10)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcrc10usa.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-marucci-catx-rckless-composite-drop-10-usa-baseball-bat-msbcrc10usa_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: Free & Fast Shipping on all orders",
    "Warranty: Full twelve (12) months through the manufacturer",
    "Length to Weight Ratio: Drop 10 (-10)",
    "Certification: USA Baseball Certified",
    "Barrel Diameter: 2 3/4 Inch",
    "Swing Feel: Slightly end-loaded",
    "Bat Material: Two-piece composite",
    "Colorway: Black, teal, & purple",
    "Ring-Free Barrel Construction: Enhances barrel flex & overall bat production",
    "FLEX Composite Barrel: Ensures max performance & barrel responsiveness",
    "OLS Connection: Stiffest connection that reduces vibrations for smooth swings",
    "TFX End Cap: Softer end cap increases forgiveness",
    "PFX Composite Handle: Engineered by bat drop enhancing speed, power, & feel",
    "Custom Knob Design: Optimized knob shape for each drop for better feel",
    "Enhanced Soft Touch Grip: Enhances feel & control"
  ]
}