{
  "name": "h3",
  "price": 199.99,
  "description": "Introducing the 2026 Victus Vibe Pro-Crayon Juco Mint Drop 10 USSSA Baseball Bat, a game-changer for aspiring sluggers. This bat boasts a mid-balanced swing feel, thanks to its innovative one-piece alloy construction and 2 3/4 inch barrel diameter, ensuring optimal performance on the field. The mint and black colorway stands out, while the authentic Juco King (Eric Sims) signature adds a touch of prestige. Engineered with VXP Alloy, it promises increased pop and extended durability, complemented by a ringless barrel construction for a thinner, more flexible sweet spot. The ergonomic handle taper and micro-perforated soft-touch grip enhance control and feel, making it a top choice for serious players. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-victus-vibe-pro-crayon-juco-mint-drop-10-usssa-baseball-bat-vsbvib10c-kj",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/v/s/vsbvib10c-kj.jpg",
  "warranty": "Length to Weight Ratio: Drop 10",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/v/s/vsbvib10c-kj.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-victus-vibe-pro-crayon-juco-mint-drop-10-usssa-baseball-bat-vsbvib10c-kj_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on ALL Orders",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 10",
    "Certification: USSSA 1.15 BPF Certified",
    "Swing Feel: Mid-Balanced",
    "Bat Material: One-Piece Alloy Composite",
    "Barrel Diameter: 2 3/4 Inch",
    "Colorway: Mint & Black",
    "Authentic Signature: Juco King (Eric Sims) Signature on Barrel",
    "Ergonomic Handle Taper: More Bat Control & Feel",
    "VXP Alloy: Increase Pop & Extended Durability",
    "Ringless Barrel Construction: Creates a Thinner, More Flexible Sweet Spot",
    "Micro-Perforated Soft-Touch Grip: Improves Feel & Control"
  ]
}