{
  "name": "h3",
  "price": 399.99,
  "description": "The 2026 Soldier Tank Drip Drop 9 Fastpitch Softball Bat is a game-changer, setting new standards with its Proprietary Trampoline Quad-Wall Technology, which delivers a \"pop\" so powerful it's akin to a trampoline. Developed by elite engineers both in the lab and on the field, this bat represents the pinnacle of innovation in softball history, thanks to years of dedicated research in composite material technology. The bat's Infused Power Technology and Enlarged Enormous Ultra Hot Sweet Spot ensure unparalleled performance, while its incredibly light swing weight and new Carbon Fiber Speed End Cap offer a perfect blend of speed and power. Designed for both power and contact hitters, it features a Soft Comfort Tack Grip and Taper Comfort Handle for enhanced control and reduced hand ringing. Officially recognized as the metal bat of Perfect Game, this top-tier bat promises extreme whip and power, making it a must-have for serious players. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-soldier-tank-drip-drop-9-fastpitch-softball-bat-st-s-26-2-9",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/s/t/st-s-26-2-9.jpg",
  "warranty": "Length to Weight Ratio: Drop 9",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/s/t/st-s-26-2-9.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-soldier-tank-drip-drop-9-fastpitch-softball-bat-st-s-26-2-9_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: Fast & Free Shipping",
    "Warranty: Full 1-Year through the manufacturer",
    "Length to Weight Ratio: Drop 9",
    "Certification: USSSA 1.20, ISA, WBSC, NSA, & USA Softball (ASA)",
    "Swing Feel: Balanced",
    "Bat Material: 2-Piece Composite",
    "Barrel Diameter: 2 3/4 Inch",
    "Colorway: Black, Pink, & Multi",
    "Hitter Type: Contact & Power",
    "7312 Trampoline Composite: Adds pop using accelerated spacers",
    "Infused Power Tech: Enlarged sweet spot",
    "Power Connector: Creates extreme whip",
    "Full Taper Handle: Maximizes control & reduces hand sting",
    "End Cap: Carbon fiber speed"
  ]
}