{
  "name": "h3",
  "price": 249.99,
  "description": "The 2026 Marucci CATX RCKLESS JBB Drop 10 Baseball Bat is a powerhouse of performance and comfort, designed for young athletes aiming for excellence. Certified with the USSSA 1.15 BPF, this bat features a balanced swing feel, thanks to its one-piece alloy construction and 2 3/4 inch barrel diameter. The striking black, sky blue, and red colorway is just the beginning, as the bat boasts a ring-free barrel construction that enhances barrel flex and overall production. With the AZR Alloy ensuring optimal performance and the AV3 Vibration Dampener minimizing vibrations, players will enjoy a comfortable and responsive experience. Additionally, the multi-variable wall design expands the sweet spot, while the TFX End Cap and custom knob design provide increased forgiveness and a tailored feel, complemented by an enhanced soft touch grip for superior control. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-marucci-catx-rckless-jbb-drop-10-baseball-bat-mjbbcr",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/j/mjbbcr.jpg",
  "warranty": "Length to Weight Ratio: Drop 10 (-10)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/j/mjbbcr.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-marucci-catx-rckless-jbb-drop-10-baseball-bat-mjbbcr_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: Free & Fast Shipping on all orders",
    "Warranty: Full twelve (12) months through the manufacturer",
    "Length to Weight Ratio: Drop 10 (-10)",
    "Certification: USSSA 1.15 BPF Certified",
    "Barrel Diameter: 2 3/4 Inch",
    "Swing Feel: Balanced",
    "Bat Material: One-piece alloy",
    "Colorway: Black, Sky Blue, & Red",
    "Ring-Free Barrel Construction: Enhances barrel flex & overall bat production",
    "AZR Alloy: Ensures optimal plate performance & bat responsiveness",
    "AV3 Vibration Dampener: Absorbs vibrations & sting for feel & comfort",
    "Multi-Variable Wall Design: Expanded sweet spot w/ forgiving barrel walls",
    "TFX End Cap: Softer end cap increases forgiveness",
    "Custom Knob Design: Optimized knob shape for each drop for better feel",
    "Enhanced Soft Touch Grip: Enhances feel & control"
  ]
}