{
  "name": "h3",
  "price": 349.95,
  "description": "Elevate your game with the 2026 DeMarini Exile Cyborg (-3) BBCOR Baseball Bat, designed for elite high school and college players seeking unmatched performance. Featuring a striking Silver & Pink X14 Alloy Barrel, this bat offers a massive barrel profile with a perfectly balanced swing weight, ensuring you cover more of the plate with ease. Its integrated handle taper and Damplify knob enhance comfort and reduce vibration, allowing for smoother swings and minimal hand sting. With its zero break-in period and Tracer End Cap for enhanced bat speed, the Exile Cyborg is engineered to deliver out-of-this-world results from the first swing. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-demarini-exile-cyborg-bbcor-baseball-bat-wbd2654010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2654010.jpg",
  "warranty": "Length to Weight Ratio: Drop 3",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2654010.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-demarini-exile-cyborg-bbcor-baseball-bat-wbd2654010_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: Fast & Free Shipping on all orders",
    "Warranty: Full 1-Year through the manufacturer",
    "Length to Weight Ratio: Drop 3",
    "Certification: BBCOR Certified",
    "Swing Feel: Balanced",
    "Bat Material: One-piece alloy",
    "Barrel Diameter: 2 5/8 Inch",
    "Bat Series: Exile",
    "Colorway: White, Black, & Red",
    "Designed For: Unmatched durability & premium pop",
    "Hot Bat Right Out of the Wrapper: Zero break-in period",
    "Tracer End Cap: For enhanced bat speed",
    "X14 Alloy Barrel: Massive barrel & easy-swinging",
    "Integrated Handle Taper: More comfort through the swing",
    "Damplify Knob: Engineered to lessen vibration"
  ]
}