{
  "name": "h3",
  "price": 399.95,
  "description": "Introducing the 2026 Demarini Lotus Drop 10 Fastpitch Softball Bat, a top-tier choice for serious players seeking power and precision. This bat features a balanced swing feel and is crafted with a two-piece composite design, ensuring optimal performance with its 2 1/4 inch barrel diameter. It's striking teal, green, and black colorway houses the Dark Matter Composite Barrel, which boasts a gapped double wall for enhanced power at the sweet spot. The innovative Damplify Connection and Knob work together to maintain responsiveness while minimizing vibrations, ensuring a comfortable and controlled swing. Certified by USSSA, USA Softball (ASA), NSA, ISA, and WBSC, this bat is engineered for excellence, with the Anomaly End Cap further optimizing barrel production by reducing swing weight. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-demarini-lotus-drop-10-fastpitch-softball-bat-wbd2606010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2606010.jpg",
  "warranty": "Length to Weight Ratio: Drop 10 (-10)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2606010.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-demarini-lotus-drop-10-fastpitch-softball-bat-wbd2606010_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 10 (-10)",
    "Certification: USSSA, USA Softball (ASA), NSA, ISA & WBSC",
    "Swing Feel: Balanced",
    "Bat Material: Two-Piece Composite",
    "Barrel Diameter: 2 1/4 Inch",
    "Bat Series: Demarini Lotus",
    "Colorway: Teal, Green & Black",
    "Dark Matter Composite Barrel: Gapped double wall for more power on the sweet spot",
    "Damplify Connection: Maintains responsiveness while reducing vibrations",
    "Damplify Knob: Dampens vibrations & creates a comfortable swing",
    "Anomaly End Cap: Enhances overall barrel production by reducing swing weight"
  ]
}