{
  "name": "h3",
  "price": 399.95,
  "description": "Elevate your game with the 2026 DeMarini CF® (-9) Fastpitch Softball Bat, engineered for powerful and consistent performance. Its Paraflex™ Plus Composite Barrel ensures a massive sweet spot, delivering reliability and responsiveness with every swing. Designed for stronger high school and college players, the CF (-9) utilizes a Type-V™ Connection to reduce hand-stinging vibrations, allowing you to focus on turning barreled-up pitches into extra-base hits. Certified for USSSA, USA Softball, NSA, ISA, and WBSC, this balanced bat comes in a striking white, pink, and purple colorway, with a Tracer End Cap to enhance bat speed and performance. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-demarini-cf-drop-9-fastpitch-softball-bat-wbd2632010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2632010.jpg",
  "warranty": "Length to Weight Ratio: Drop 9 (-9)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2632010.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-demarini-cf-drop-9-fastpitch-softball-bat-wbd2632010_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on all orders",
    "Warranty: Full 1-year through the manufacturer",
    "Length to Weight Ratio: Drop 9 (-9)",
    "Certification: USSSA, USA Softball (ASA), NSA, ISA & WBSC",
    "Swing Feel: Balanced",
    "Bat Material: Two-piece composite",
    "Barrel Diameter: 2 1/4 Inch",
    "Handle Size: 0.800\" Handle to dampen vibrations",
    "Colorway: White, Pink, & Purple",
    "Tracer End Cap: Enhances bat speed & barrel performance",
    "Paraflex Plus Composite: Provides massive sweet spot & responsiveness",
    "Type V Connection: Reduces hand vibration and transfers energy to the barrel"
  ]
}