{
  "name": "h3",
  "price": 249.95,
  "description": "The 2026 DeMarini Voodoo One Drop 10 JBB Baseball Bat stands out with its balanced swing feel and is certified by USA Baseball, making it a top choice for young athletes. Featuring a 2 3/4 inch barrel diameter, this bat is crafted from a high-strength DX1 Alloy, ensuring unmatched durability and premium pop with every hit. Its striking blue colorway with white accents not only looks great but also highlights its cutting-edge design. The Ion D End Cap further optimizes barrel performance, providing a light swing weight that enhances your game right out of the wrapper with no break-in period needed. Part of the renowned Voodoo series, this bat is engineered for players seeking superior performance on the field. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-demarini-voodoo-one-drop-10-jbb-baseball-bat-wbd2600010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2600010.jpg",
  "warranty": "Length to Weight Ratio: Drop 10",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbd2600010.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-demarini-voodoo-one-drop-10-jbb-baseball-bat-wbd2600010_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on all orders",
    "Expanded Warranty: Full 1-year through the manufacturer",
    "Length to Weight Ratio: Drop 10",
    "Certification: USA Baseball",
    "Swing Feel: Balanced",
    "Bat Material: One-piece alloy",
    "Barrel Diameter: 2 3/4 Inch",
    "Bat Series: Voodoo",
    "Colorway: Blue with white accents",
    "Designed For: Unmatched durability & premium pop",
    "Hot Bat Right Out of the Wrapper: Zero break-in period",
    "Ion D End Cap: Light swing weight w/ optimized barrel performance",
    "DX1 Alloy Barrel: High-strength alloy for performance & durability"
  ]
}