{
  "name": "h3",
  "price": 349.99,
  "description": "The 2026 Marucci CATX RCKLESS Hybrid Drop 5 USSSA Baseball Bat is a top-tier choice for players seeking a balanced swing feel and exceptional performance. Certified with a USSSA 1.15 BPF and featuring a 2 3/4 inch barrel diameter, this bat combines a two-piece hybrid construction with a striking black, neon green, and sky blue colorway. The ring-free barrel construction enhances barrel flex and overall bat production, while the OLS connection offers the stiffest connection to reduce vibrations for smoother swings. Crafted with AZR Alloy for optimal plate performance and bat responsiveness, the CATX RCKLESS also boasts a multi-variable wall design for an expanded sweet spot and forgiving barrel walls. Additional features include a TFX end cap for increased forgiveness, a PFX composite handle for enhanced speed, power, and feel, a custom knob design for improved grip, and an enhanced soft-touch grip for superior control. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-marucci-catx-rckless-hybrid-drop-5-usssa-baseball-bat-msbcrh5",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcrh5.jpg",
  "warranty": "Length to Weight Ratio: Drop 5 (-5)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcrh5.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\2026-marucci-catx-rckless-hybrid-drop-5-usssa-baseball-bat-msbcrh5_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: Free & Fast Shipping on all orders",
    "Warranty: Full twelve (12) months through the manufacturer",
    "Length to Weight Ratio: Drop 5 (-5)",
    "Certification: USSSA 1.15 BPF Certified",
    "Barrel Diameter: 2 3/4 Inch",
    "Swing Feel: Slightly end-loaded",
    "Bat Material: Two-piece hybrid",
    "Colorway: Black, neon green, & sky blue",
    "Ring-Free Barrel Construction: Enhances barrel flex & overall bat production",
    "OLS Connection: Stiffest connection that reduces vibrations for smooth swings",
    "AZR Alloy: Ensures optimal plate performance & bat responsiveness",
    "Multi-Variable Wall Design: Expanded sweet spot w/ forgiving barrel walls",
    "TFX End Cap: Softer end cap increases forgiveness",
    "PFX Composite Handle: Engineered by bat drop enhancing speed, power, & feel",
    "Custom Knob Design: Optimized knob shape for each drop for better feel",
    "Enhanced Soft Touch Grip: Enhances feel & control"
  ]
}