{
  "name": "h3",
  "price": 299.99,
  "description": "The Axe Strato 2 Flared Knob BBCOR Baseball Bat is designed for power hitters seeking unmatched performance and precision. With its end-loaded swing feel and a 2 5/8 inch barrel diameter, this bat delivers a formidable punch, while the hybrid construction combines an alloy barrel with a composite handle for optimal durability and power. The innovative Endogrid Technology minimizes hand vibrations, ensuring a comfortable grip and swing, while the flared knob shape enhances swing freedom for peak performance. Engineered with Armor Alloy Ultra Barrel and CNC Precision Variable Engineering, this bat boasts a thin yet incredibly strong sweet spot, complemented by the Composite Hyperwhip 2 Endcap that reduces weight for faster, more efficient swings. Approved for BBCOR play, it's the perfect choice for high school and college athletes aiming to elevate their game. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/axe-strato-2-flared-knob-bbcor-baseball-bat-l137m-flr",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/l/1/l137m_flr.jpg",
  "warranty": "Length to Weight Ratio: Drop 3",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/l/1/l137m_flr.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\axe-strato-2-flared-knob-bbcor-baseball-bat-l137m-flr_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on all orders",
    "Warranty: Full 1-year through the manufacturer",
    "Length to Weight Ratio: Drop 3",
    "Approved For: BBCOR - High School & College Play",
    "Barrel Diameter: 2 5/8 Inch",
    "Swing Feel: End Loaded",
    "Hitting Style: Power Hitter",
    "Bat Material: Hybrid - Alloy Barrel & Composite Handle",
    "Power Hitter Sweet Spot: High performance towards the end of the bat",
    "Endogrid Technology: Reduces hand vibration",
    "Knob Shape: Flared - Frees swing for top performance",
    "Armor Alloy Ultra Barrel: Creates the thinnest & liveliest sweet spot",
    "CNC Precision Variable Engineering: Strong as a thick wall & light like a thin wall",
    "Composite Hyperwhip 2 Endcap: Reduces weight for a faster & more efficient barrel"
  ]
}