{
  "name": "h3",
  "price": 279.99,
  "description": "The Chandler NG07 Alien Maple Wood Bat is a top-tier choice for serious players, featuring a unique black and lime green colorway that stands out on the field. With a slight end-loaded swing feel and thin flare handle, this bat is designed for power hitters seeking an optimal hitting surface provided by its large barrel. The Turn Model NG07 offers a drop 3 length to weight ratio, enhancing swing precision and control. Engineered for pro-grade durability, it is ink dot certified and boasts a half cup for improved weight distribution. Exclusively available at Better Baseball, this bat showcases an eye-catching alien emblem and slime, along with cryptic handle design, making it a must-have for ballplayers. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 60 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/chandler-ng07-alien-maple-wood-bat-ng07-alien",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/n/g/ng07-alien.jpg",
  "warranty": "Turn Model: NG07",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/n/g/ng07-alien.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\chandler-ng07-alien-maple-wood-bat-ng07-alien_1.jpg"
  ],
  "category_path": [
    "Bats",
    "Baseball Bats",
    "Wood Bats"
  ],
  "features": [
    "Exclusive: Only at Better Baseball",
    "D elivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 60-Days through the Manufacturer",
    "Turn Model: NG07",
    "Length to Weight Ratio: Drop 3",
    "Colorway: Black & Lime Green",
    "Swing Feel: Slightly End-Loaded",
    "Bat Material: Maple Wood",
    "Knob: Flare",
    "Handle: Thin",
    "Large Barrel: For Optimal Hitting Surface",
    "Ink Dot Certified: For Pro Grade Durability",
    "Half Cup: Helps Improve Weight Distribution"
  ]
}