{
  "name": "h3",
  "price": 219.0,
  "description": "The Chandler CB24 Maple Wood Bat is a proprietary model crafted for elite high school and collegiate players, specifically designed for power hitters making the transition to wood. Featuring a sharp taper at the transition and a medium flare leading to a comfortably thin handle, this bat offers a balanced swing feel that caters to both contact and power hitters. The CB24 is constructed with very dense and hard wood to maximize ball flight, while the large barrel provides an optimal hitting surface. With its grey colorway accented by red holo details, this bat not only performs exceptionally but also stands out visually. Ink Dot Certified for pro-grade durability, the full-cup design enhances weight distribution, making it a top choice for serious players. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 60 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/chandler-cb24-maple-wood-bat-cb24-grey",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/c/b/cb24-grey.jpg",
  "warranty": "Turn Model: CP24",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/c/b/cb24-grey.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\chandler-cb24-maple-wood-bat-cb24-grey_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Exclusive: Only at Better Baseball",
    "D elivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 60-Days through the Manufacturer",
    "Turn Model: CP24",
    "Length to Weight Ratio: Drop 3",
    "Colorway: Grey w/ Red Holo Accents",
    "Swing Feel: Balanced",
    "Hitting Style: Built for Contact & Power Hitters",
    "Bat Material: Maple Wood",
    "Knob: Traditional",
    "Handle: Thin",
    "Large Barrel: For Optimal Hitting Surface",
    "Ink Dot Certified: For Pro Grade Durability",
    "Full Cup: Helps Improve Weight Distribution"
  ]
}