{
  "name": "h3",
  "price": 219.0,
  "description": "The Chandler Fernando Tatis FT23 Maple Wood Bat is expertly crafted for hitters who crave versatility and performance. Featuring a sleek black and blue colorway, this bat boasts a slightly end-loaded swing feel, making it ideal for both contact and power hitters. Its thin handle and traditional knob provide a comfortable grip, while the elongated 2.5\" barrel ensures a large sweet spot for maximum impact. The bat's pro-grade durability is highlighted by its Ink Dot Certification, and its cupped end optimizes weight distribution for a balanced swing. This bat provides superior performance on the field. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 60 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/chandler-fernando-tatis-ft23-maple-wood-bat-ft23-22",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/f/t/ft23.22.jpg",
  "warranty": "Turn Model: FT23",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/f/t/ft23.22.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\chandler-fernando-tatis-ft23-maple-wood-bat-ft23-22_1.jpg"
  ],
  "category_path": [
    "Bats",
    "Chandler Fernando Tatis FT23 Maple Wood Bat: FT23.22"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 60-Days through the Manufacturer",
    "Turn Model: FT23",
    "Length to Weight Ratio: Drop 3",
    "Colorway: Black & Blue",
    "Swing Feel: Slightly End-Loaded",
    "Hitting Style: Built for Both Contact & Power Hitters",
    "Bat Material: Maple",
    "Knob: Traditional",
    "Handle: Thin",
    "Elongated 2.5\" Barrel: Equips Large Sweet Spot",
    "Ink Dot Certified: For Pro Grade Durability",
    "Cupped End: Helps Improve Weight Distribution"
  ]
}