{
  "name": "h3",
  "price": 279.99,
  "description": "The Chandler BH3 Bow Hunter Maple Wood Bat is a top-tier choice for players seeking precision and balance in their swing. Nearly identical to the RH7 model and famously wielded by Bryce Harper, this bat is engineered for performance with its long tapered, small to medium-sized barrel that enhances control and power. The medium-sized handle and distinctive cone-shaped knob provide a comfortable grip, making it ideal for players who value consistency and feel. Experience the balanced design of the BH3, crafted to deliver exceptional results on the field. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 60 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/chandler-bh3-bow-hunter-maple-wood-bat-bh3-bowhunter",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/b/h/bh3-bowhunter.jpg",
  "warranty": "Turn Model: BH3",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/b/h/bh3-bowhunter.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\chandler-bh3-bow-hunter-maple-wood-bat-bh3-bowhunter_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 60-Days through the Manufacturer",
    "Turn Model: BH3",
    "Length to Weight Ratio: Drop 3",
    "Colorway: Grey & Black",
    "Custom Bowhunter Logo: For Added Flair",
    "Swing Feel: Balanced",
    "Bat Material: Maple Wood",
    "Knob: Cone",
    "Handle: Medium",
    "Small/Medium Barrel: For Balanced Feel",
    "Ink Dot Certified: For Pro Grade Durability",
    "XP Finish: \"Cured\" an Extra 3-days for 2X the Hardness"
  ]
}