{
  "name": "h3",
  "price": 279.99,
  "description": "The Chandler AP5A Zombie Maple Wood Bat is a top-tier choice for serious baseball players, inspired by the iconic Albert Pujols AP5 model. Renowned for its larger barrel and pinched transition, this bat enhances whip through the zone, offering a perfect blend of balance and power for contact and power hitters alike. Its distinctive design features a glossy black finish with blood splatter and barbed wire graphics, complemented by a unique logo that adds flair. With a flared knob, medium handle, and large barrel, this bat ensures an optimal hitting surface, while the ink dot certification and XP finish guarantee pro-grade durability and double the hardness for an unrivaled swing feel. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 60 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/chandler-ap5a-zombie-maple-wood-bat-ap5a-zombie",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/a/p/ap5a-zombie.jpg",
  "warranty": "Turn Model: AP5A",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/a/p/ap5a-zombie.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\chandler-ap5a-zombie-maple-wood-bat-ap5a-zombie_1.jpg"
  ],
  "category_path": [
    "Bats",
    "Chandler AP5A Zombie Maple Wood Bat: AP5A-ZOMBIE"
  ],
  "features": [
    "Exclusive: Only at Better Baseball",
    "D elivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 60-Days through the Manufacturer",
    "Turn Model: AP5A",
    "Length to Weight Ratio: Drop 3",
    "Colorway: Glossy Black, Blood Splatter, & Barbed Wire",
    "One-of-Kind Logo: For Added Flair",
    "Swing Feel: Balanced",
    "Hitting Style: Built for Contact & Power Hitters",
    "Bat Material: Maple Wood",
    "Knob: Flared",
    "Handle: Medium",
    "Large Barrel: For Optimal Hitting Surface",
    "Ink Dot Certified: For Pro Grade Durability",
    "Half Cup: Helps Improve Weight Distribution",
    "XP Finish: \"Cured\" an Extra 3-days for 2X the Hardness"
  ]
}