{
  "name": "h3",
  "price": 229.95,
  "description": "Discover the Chandler JAZZ.XT Torpedo Maple Wood Baseball Bat, one of the hottest bats in the game that’s making waves across all levels of play. This innovative bat features a uniquely shaped torpedo barrel designed to enhance your hitting performance by moving the sweet spot lower on the bat, where contact is most often made. Its stunning design includes a palladium barrel and handle with a sleek gloss finish, complemented by a striking Carbon Fiber Chandler logo. With a flare knob taper, medium handle thickness, and long barrel taper, this bat offers a balanced feel that’s perfect for serious hitters looking to elevate their game. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 60 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/chandler-jazz-xt-torpedo-maple-wood-baseball-bat-jazz-xt-torpedo",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/j/a/jazz.xt-torpedo.jpg",
  "warranty": "Length to Weight Ratio: Drop 3",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/j/a/jazz.xt-torpedo.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\chandler-jazz-xt-torpedo-maple-wood-baseball-bat-jazz-xt-torpedo_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on all orders",
    "Warranty: Full 60-Days through the Manufacturer",
    "Length to Weight Ratio: Drop 3",
    "Colorway: Black w/ Silver Accents",
    "Swing Feel: Balanced",
    "Bat Material: Maple Wood",
    "Knob: Flared",
    "Handle: Medium",
    "Torpedo Barrel: Maximized sweet spot",
    "Ink Dot Certified: For pro-grade durability",
    "Palladium Barrel & Handle: Sleek, premium finish"
  ]
}