{
  "name": "h3",
  "price": 239.99,
  "description": "The Dove Tail G27S ProXR Signature Series Baseball Bat is expertly crafted for professional player Giancarlo Stanton, featuring the innovative ProXR Epic2 patented knob. This unique design includes a smaller, angled knob that reduces pressure on the hamate section of the hand, enhancing comfort and control. The bat is slightly end-loaded with a thin handle, providing an incredible amount of whip for powerful swings. Its all-black finish with a textured sand shark design ensures a sleek appearance, while the cupped ends offer optimum balance and weight differential. Ideal for players seeking performance and style, this bat is available in both maple and birch options. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 60 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/dove-tail-g27s-proxr-signature-series-birch-baseball-bat-dtb-gs27-proxr",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/d/t/dtb-gs27-proxr.jpg",
  "warranty": "Turn Model: G27S",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/d/t/dtb-gs27-proxr.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\dove-tail-g27s-proxr-signature-series-birch-baseball-bat-dtb-gs27-proxr_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 60-Days through the Manufacturer",
    "Turn Model: G27S",
    "Length to Weight Ratio: Drop 3",
    "Colorway: Black w/ Gold accents",
    "Swing Feel: Slightly End-Loaded",
    "Hitting Style: Contact and Power Hitters",
    "Bat Material: Birch",
    "Knob: ProXR Epic2",
    "Handle: 29/32\" Built for optimal control",
    "Barrel Diameter: 2 1/2 Inch",
    "Cupped End: Helps improve weight distribution"
  ]
}