{
  "name": "h3",
  "price": 179.99,
  "description": "The Louisville Slugger D235 Maple Wood Baseball Bat is expertly crafted for players seeking a balanced swing feel and exceptional contact hitting. Featuring the Turn Model 234, this bat boasts a sleek stain and black colorway that stands out on the field. Its huge sweet spot and medium barrel are designed for precision and power, while the flared knob and medium handle offer enhanced grip and control. Engineered for pro-grade durability, the bat is Ink Dot Certified, pro-hardened, and treated with UV light to ensure a harder, denser surface and an improved weight distribution, thanks to its cupped barrel end. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 75 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/louisville-slugger-d235-maple-wood-baseball-bat-lvs-d235",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/l/v/lvs-d235.jpg",
  "warranty": "Turn Model: 234",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/l/v/lvs-d235.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\louisville-slugger-d235-maple-wood-baseball-bat-lvs-d235_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 75-Days through the Manufacturer",
    "Turn Model: 234",
    "Length to Weight Ratio: Drop 2",
    "Colorway: Stain & Black",
    "Swing Feel: Balanced",
    "Hitting Style: Built for Contact",
    "Bat Material: Pro Maple Wood Material",
    "Knob: Flared",
    "Handle: Medium",
    "Medium Barrel: Huge Sweet Spot",
    "Ink Dot Certified: For Pro Grade Durability",
    "Cupped Barrel End: Helps Improve Weight Distribution",
    "Pro Hardened: Compressing the Bat for Harder & Denser Surfaces",
    "UV Light Treatment: Special Treatment to Cure & Harden the Finish"
  ]
}