{
  "name": "h3",
  "price": 169.95,
  "description": "The Louisville Slugger Pro Prime VG27 Birch Wood Bat is expertly crafted for power hitters seeking an edge at the plate. With its barrel-loaded swing feel and huge sweet spot, this bat is designed to deliver explosive hits. Featuring a VG27 turn model, it boasts a flared knob and thin handle, offering a comfortable grip for optimal control. The bat's black and natural colorway adds a classic touch, while its pro-hardened, compressed surface ensures unparalleled durability. Ink dot certified, this bat meets pro-grade standards, making it a top choice for serious players. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 75 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/louisville-slugger-pro-prime-vg27-birch-wood-bat-wbl2936010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl2936010.jpg",
  "warranty": "Turn Model: VG27",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl2936010.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\louisville-slugger-pro-prime-vg27-birch-wood-bat-wbl2936010_1.jpg"
  ],
  "category_path": [
    "Bats",
    "Louisville Slugger Pro Prime VG27 Birch Wood Bat: WBL2936010"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 30-Days through the Manufacturer",
    "Turn Model: VG27",
    "Length to Weight Ratio: Drop 3",
    "Colorway: Black and Natural",
    "Swing Feel: Barrel-Loaded",
    "Hitting Style: Power Hitters",
    "Bat Material: Maple",
    "Knob: Flared",
    "Handle: Thin",
    "Large Barrel: Huge Sweet Spot",
    "Ink Dot Certified: For Pro Grade Durability",
    "Pro Hardened: Compressed For a Harder Hitting Surface"
  ]
}