{
  "name": "h3",
  "price": 299.95,
  "description": "Elevate your performance at wood bat tournaments or during batting practice with the Louisville Slugger Pro Prime RA13 Maple Composite Wood Baseball Bat. Designed in collaboration with Ronald Acuña Jr., this bat features a high-gloss natural maple barrel that offers a large sweet spot and slightly endloaded swing weight for powerful hits. Its internal composite tube enhances durability, making it perfect for year-round use, while the matte black handle provides a classic aesthetic. Approved for BBCOR action and Perfect Game play, this bat ensures you can compete at the highest levels. Plus, it comes with a limited 1-year warranty, offering peace of mind with every swing. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/louisville-slugger-pro-prime-ra13-maple-composite-wood-baseball-bat-wbl4163010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl4163010.jpg",
  "warranty": "Turn Model: RA13",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl4163010.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\louisville-slugger-pro-prime-ra13-maple-composite-wood-baseball-bat-wbl4163010_1.jpg"
  ],
  "category_path": [
    "Bats",
    "Louisville Slugger Pro Prime RA13 Maple Composite Wood Baseball Bat"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on all orders",
    "Warranty: Full 1-year through the manufacturer",
    "Turn Model: RA13",
    "Length to Weight Ratio: Drop 3",
    "Colorway: Natural barrel with matte black handle",
    "Swing Feel: Slightly end-loaded",
    "Hitting Style: Built for contact & power hitters",
    "Bat Material: High-grade maple wood composite",
    "Knob: Flared",
    "Handle: Medium",
    "Barrel Diameter: 2 5/8 Inch",
    "Cupped End: Helps Improve Weight Distribution",
    "Internal Composite Tube: Reinforced structure for added durability",
    "Perfect Game Eligible: Approved for Perfect Game & other wood bat tournaments"
  ]
}