{
  "name": "h3",
  "price": 119.95,
  "description": "The Louisville Slugger MLB Prime C271 Birch Wood Bat is expertly crafted for both contact and power hitters seeking a balanced swing feel. Featuring a sleek black colorway, this bat boasts a huge sweet spot, making it ideal for players aiming to maximize their hitting potential. Its flared knob and thin handle provide enhanced grip and control, while the cupped barrel end ensures optimal weight distribution. With an impressive drop 3 length to weight ratio and pro-hardened compression for a harder hitting surface, this bat is ink dot certified, ensuring pro-grade durability and performance on the field. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 75 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/louisville-slugger-mlb-prime-c271-birch-wood-bat-wtlwpb271",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/t/wtlwpb271.jpg",
  "warranty": "Turn Model: C271",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/t/wtlwpb271.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\louisville-slugger-mlb-prime-c271-birch-wood-bat-wtlwpb271_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 75-Days through the Manufacturer",
    "Turn Model: C271",
    "Length to Weight Ratio: Drop 3",
    "Colorway: Black",
    "Swing Feel: Balanced",
    "Hitting Style: Contact and Power Hitters",
    "Bat Material: Birch",
    "Knob: Flared",
    "Handle: Thin",
    "Medium Barrel: Huge Sweet Spot",
    "Ink Dot Certified: For Pro Grade Durability",
    "Cupped Barrel End: Helps Improve Weight Distribution",
    "Pro Hardened: Compressed For a Harder Hitting Surface"
  ]
}