{
  "name": "h3",
  "price": 169.95,
  "description": "The Louisville Slugger Pro Prime Mint TPD1 Torpedo Maple Wood Bat is meticulously engineered to enhance player performance by maximizing the sweet spot. Its innovative torpedo shape redistributes mass toward the center brand, ensuring that players can consistently make powerful contact. With a pro-hardened surface achieved through steel rod compression, this bat offers a harder and denser barrel for optimal hitting. The slight handle taper enhances comfort, while the UV light-treated Pro Series Finish provides a durable, high-gloss topcoat. Backed by a 75-day limited warranty, this bat represents the pinnacle of performance and reliability. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 75 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/louisville-slugger-pro-prime-mint-tpd1-torpedo-maple-wood-bat-wbl4214010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl4214010.jpg",
  "warranty": "Turn Model: TPD1",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl4214010.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\louisville-slugger-pro-prime-mint-tpd1-torpedo-maple-wood-bat-wbl4214010_1.jpg"
  ],
  "category_path": [
    "Bats",
    "Louisville Slugger Pro Prime Mint TPD1 Torpedo Maple Wood Bat: WBL4214010"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 75-Days through the Manufacturer",
    "Turn Model: TPD1",
    "Length to Weight Ratio: Drop 3",
    "Colorway: Mint & Black",
    "Swing Feel: Balanced",
    "Hitting Style: Contact & Power",
    "Bat Material: Maple",
    "Knob: Tapered",
    "Handle: Medium",
    "Torpedo Barrel: Barrel mass is shifted toward the center for added weight in the sweet spot & improved contact consistency",
    "UV Light Treatment : Ultraviolet lamp instantly cures & hardens the topcoat for maximum durability",
    "Ink Dot Certified: For Pro Grade Durability",
    "Pro Hardened: Compressed For a Harder Hitting Surface"
  ]
}