{
  "name": "h3",
  "price": 169.95,
  "description": "The Louisville Slugger Pro Prime TPD1 Torpedo Baseball Bat is meticulously engineered to enhance player performance by maximizing sweet spot contact. Its innovative design redistributes mass from the barrel's end toward the center, amplifying the sweet spot's weight for more powerful hits. Crafted with a pro-hardened surface, this bat boasts a dense, durable barrel achieved through advanced compression techniques. The slight handle taper ensures improved comfort, while the UV light-treated Pro Series Finish adds a sleek, high-gloss topcoat. Enjoy peace of mind with a best-in-class 75-day limited warranty on all new Prime bats. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 75 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/louisville-slugger-pro-prime-natural-tpd1-torpedo-maple-wood-bat-wbl4213010",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl4213010.jpg",
  "warranty": "Turn Model: TPD1",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/w/b/wbl4213010.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\louisville-slugger-pro-prime-natural-tpd1-torpedo-maple-wood-bat-wbl4213010_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 75-Days through the Manufacturer",
    "Turn Model: TPD1",
    "Length to Weight Ratio: Drop 3",
    "Colorway: Natural",
    "Swing Feel: Balanced",
    "Hitting Style: Contact & Power",
    "Bat Material: Maple",
    "Knob: Tapered",
    "Handle: Medium",
    "Torpedo Barrel: Barrel mass is shifted toward the center for added weight in the sweet spot & improved contact consistency",
    "UV Light Treatment : Ultraviolet lamp instantly cures & hardens the topcoat for maximum durability",
    "Ink Dot Certified: For Pro Grade Durability",
    "Pro Hardened: Compressed For a Harder Hitting Surface"
  ]
}