{
  "name": "h3",
  "price": 209.95,
  "description": "The Marucci Lindy12 Torpedo Pro Maple Wood Bat is a masterful redesign of the LINDY12 Pro Exclusive, tailored for enhanced barrel performance. By strategically shifting mass into the sweet spot, it maximizes force on contact, making it a powerhouse for hitters. Inspired by Marucci Athlete Francisco Lindor, this bat boasts a unique bell knob with a slightly flared and rounded end, complemented by a thin handle and innovative torpedo barrel for a slightly end-loaded feel. Upgraded to the PRO-X finish, with Francisco Lindor's signature engraved on the barrel, this handcrafted bat is ideal for seasoned players seeking peak performance. Certified with a Big League-grade ink dot and backed by an extended 60-day warranty, it's crafted in the USA from top-quality maple and bone-rubbed for ultimate wood density. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 30 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/marucci-lindy12-torpedo-pro-maple-wood-bat-mve5lind12t",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/v/mve5lind12t.jpg",
  "warranty": "Length to Weight Ratio: Drop 3",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/v/mve5lind12t.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\marucci-lindy12-torpedo-pro-maple-wood-bat-mve5lind12t_1.jpg"
  ],
  "category_path": [
    "Bats",
    "Marucci Lindy12 Torpedo Pro Maple Wood Bat: MVE5LIND12T"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 60-Days through the Manufacturer",
    "Length to Weight Ratio: Drop 3",
    "Colorway: Burnt Orange & Maroon w/ White Accents",
    "Swing Feel: Balanced",
    "Hitting Style: Built for Both Contact & Power Hitters",
    "Bat Material: Handcrafted from Top-Quality Maple Wood",
    "Knob: Slightly Flared",
    "Handle: Thin",
    "Medium Barrel: Optimal Hitting Surface",
    "Ink Dot Certified: For Pro Grade Durability",
    "Bat Series: Marucci Lindy12 Pro Model",
    "Bone Rubbed: Tightens Grains for a Harder Hitting Surface",
    "Pro Cupped End: Helps Improve Weight Distribution"
  ]
}