{
  "name": "h3",
  "price": 209.95,
  "description": "Discover the Marucci Kindy12 Green Maple Francisco Lindor Wood Bat, engineered for excellence with a drop 3 length-to-weight ratio, making it perfect for both contact and power hitters. This striking bat features a green barrel and natural handle with silver accents, offering a slightly end-loaded swing feel that leans more towards balance. Handcrafted with precision, it boasts a flared knob, thin handle, and medium barrel for an optimal hitting surface. The Marucci Lindy12 Pro Model is ink dot certified for pro-grade durability and bone rubbed to tighten grains, ensuring a harder hitting surface. Its pro cupped end enhances weight distribution, delivering a superior batting experience. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 30 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/marucci-lindy12-green-maple-francisco-lindor-wood-bat-mcwm-lindy12-25",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/c/mcwm-lindy12-25.jpg",
  "warranty": "Length to Weight Ratio: Drop 3",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/c/mcwm-lindy12-25.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\marucci-lindy12-green-maple-francisco-lindor-wood-bat-mcwm-lindy12-25_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 30-Days through the Manufacturer",
    "Length to Weight Ratio: Drop 3",
    "Colorway: Green Barrel & Natural Handle with Silver Accents",
    "Swing Feel: Slightly End-Loaded (More on the Balanced Side)",
    "Hitting Style: Built for Both Contact & Power Hitters",
    "Bat Material: Handcrafted from Top-Quality Maple Wood",
    "Knob: Flared",
    "Handle: Thin",
    "Medium Barrel: Optimal Hitting Surface",
    "Ink Dot Certified: For Pro Grade Durability",
    "Bat Series: Marucci Lindy12 Pro Model",
    "Bone Rubbed: Tightens Grains for a Harder Hitting Surface",
    "Pro Cupped End: Helps Improve Weight Distribution"
  ]
}