{
  "name": "h3",
  "price": 225.0,
  "description": "The Mine Baseball Storm Pro Beech Wood Baseball Bat is expertly crafted for players seeking versatility and performance. Featuring a balanced swing feel, this bat is ideal for both contact and power hitters, thanks to its Drop 3 length-to-weight ratio. The light blue and white colorway, complemented by a cupped barrel end, enhances its sleek appearance. With a flared knob and built-in grip, it reduces vibrations on mis-hits, ensuring a comfortable experience. The six-layer paint finishing eliminates imperfections, while the Ink Dot Certification guarantees pro-grade durability. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 182 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/mine-baseball-storm-pro-beech-wood-baseball-bat-mb-storm",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/b/mb-storm.jpg",
  "warranty": "Length to Weight Ratio: Drop 3",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/b/mb-storm.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\mine-baseball-storm-pro-beech-wood-baseball-bat-mb-storm_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "D elivery: Fast & Free Shipping on all orders",
    "Warranty: Full 6-months through the manufacturer",
    "Length to Weight Ratio: Drop 3",
    "Colorway: Light Blue/White",
    "Barrel End: Cupped",
    "Swing Feel: Balanced",
    "Hitting Style: Built for Both Contact & Power Hitters",
    "Bat Material: Beech Wood",
    "Knob: Flared",
    "Ink Dot Certified: For Pro Grade Durability",
    "Built-In Grip: Reduces vibrations on mis-hits",
    "6-Layer Paint Finishing: Eliminates imperfections"
  ]
}