{
  "name": "h3",
  "price": 194.95,
  "description": "Discover the power of the Old Hickory MT27 Mike Trout Steel Pressed Maple Wood Bat, now available and in stock! This bat features the same model and finish as Mike Trout's game bat, boasting the hardest finish in the game with its innovative STEEL PRESSED technology. Experience unparalleled durability and enhanced exit velocities thanks to grains compacted and compressed with cold, hard steel. The MT27's long barrel and superb balance ensure maximum production on the field, while its 45-Day Warranty offers the best protection for your investment. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 45 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/old-hickory-mt27-mike-trout-steel-pressed-maple-wood-bat-mt27steel-ntrl",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/t/mt27steel-ntrl.jpg",
  "warranty": "Turn Model: MT27 (Mike Trout)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/t/mt27steel-ntrl.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\old-hickory-mt27-mike-trout-steel-pressed-maple-wood-bat-mt27steel-ntrl_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 45-Days through the Manufacturer",
    "Turn Model: MT27 (Mike Trout)",
    "Length to Weight Ratio: Drop 3",
    "Colorway: Natural",
    "Swing Feel: Balanced",
    "Hitting Style: Built for Both Contact & Power Hitters",
    "Bat Material: Pro Rock Model Maple Wood",
    "Knob: Standard",
    "Handle: Thin",
    "Large 2.5\" Barrel: Provides Huge Hitting Surface",
    "Ink Dot Certified: For Pro Grade Durability",
    "Cupped Barrel End: Helps Improve Weight Distribution"
  ]
}