{
  "name": "h3",
  "price": 174.99,
  "description": "Elevate your game with the Tater X12 Pro Maple Wood Baseball Bat, renowned for its unmatched balance and speed. Step up to the plate with confidence, wielding this top-of-the-line X series model, celebrated for its exceptional balance and swift barrel whip through the zone. Designed with input from professional players, the Tater X12 is engineered for the ultimate contact hitter, featuring a pro-inspired design drawing from Francisco Lindor's custom game model. Its compact barrel and comfortable handle ensure a smooth, controlled swing, while the flared bell knob enhances grip and reduces strain. Crafted with precision and durability, this bat is your key to consistent and powerful hits, made proudly in the USA and backed by a 30-day warranty. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 30 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/tater-x12-pro-maple-wood-baseball-bat-tater-x12",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/t/a/tater-x12.jpg",
  "warranty": "Model: X12 Pro",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/t/a/tater-x12.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\tater-x12-pro-maple-wood-baseball-bat-tater-x12_1.jpg"
  ],
  "category_path": [
    "Bats",
    "Tater X12 Pro Maple Wood Baseball Bat: TATER-X12"
  ],
  "features": [
    "D elivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 30-Days through the Manufacturer",
    "Model: X12 Pro",
    "Length to Weight Ratio: Drop 3",
    "Colorway: Black",
    "Swing Feel: Balanced",
    "Hitting Style: Contact & Power Hitters",
    "Bat Material: Maple",
    "Knob: Flared",
    "Handle: Thin",
    "Medium Barrel: Huge sweet spot",
    "Ink Dot Certified: For pro grade durability",
    "Cupped Barrel End: Helps improve weight distribution",
    "Bell Knob: Added comfort & grip that reduces strain"
  ]
}