{
  "name": "h3",
  "price": 189.99,
  "description": "Introducing the Tucci Torpedo Pro Select Subzero Limited Maple Wood Baseball Bat, hailed by ESPN as baseball's \"next big thing.\" This bat features an innovative Torpedo barrel design with an elongated shape to maximize surface area, ensuring more frequent and harder contact with the ball. The unique weight distribution optimizes the sweet spot by shifting weight 6-7 inches below the bat's end, enhancing your swing's power and precision. Hand-crafted from the highest grade of hand-split billets, this bat boasts a balanced swing feel, a tapered knob, and a thin handle, all coated with a three-part ultra-gloss clearcoat for a harder surface. The teal and blue gradient colorway adds a striking visual appeal, while the ink dot certification guarantees pro-grade durability. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 60 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/tucci-torpedo-pro-select-subzero-limited-maple-wood-baseball-bat-tl-torpedo-subzero",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/t/l/tl-torpedo-subzero.jpg",
  "warranty": "Length to Weight Ratio: Drop 2.5",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/t/l/tl-torpedo-subzero.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\tucci-torpedo-pro-select-subzero-limited-maple-wood-baseball-bat-tl-torpedo-subzero_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on all orders",
    "Warranty: Full 60-Days through the Manufacturer",
    "Length to Weight Ratio: Drop 2.5",
    "Colorway: Teal & Blue Gradient",
    "Swing Feel: Balanced",
    "Bat Material: Maple Wood",
    "Knob: Tapered",
    "Handle: Thin",
    "Torpedo Barrel: Maximized sweet spot",
    "Ink Dot Certified: For pro-grade durability",
    "Ultra Gloss Clearcoat: Creates a harder bat surface"
  ]
}