{
  "name": "h3",
  "price": 219.95,
  "description": "Introducing the Victus M3RRILL Custom Pro Reserve Maple Wood Baseball Bat, a top-tier choice for contact and power hitters. This pro model, known as the Jackson Merrill M3RRILL, is expertly crafted with a slightly end-loaded swing feel, making it perfect for catching barrels with ease. The bat features a thin handle and a flared knob, ensuring a smooth transition for hitters seeking precision and comfort. With a vibrant red colorway accented by gold, this bat not only performs exceptionally but also stands out on the field. Enhanced with a ProPACT finish for a hard surface and maximum durability, the M3RRILL is ink dot certified, ensuring pro-grade reliability. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 61 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/victus-m3rrill-custom-pro-reserve-maple-wood-baseball-bat-cstmv-m3rrill",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/c/s/cstmv-m3rrill.jpg",
  "warranty": "Turn Model: M3RRILL",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/c/s/cstmv-m3rrill.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\victus-m3rrill-custom-pro-reserve-maple-wood-baseball-bat-cstmv-m3rrill_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "Exclusive: Only at Better Baseball",
    "Delivery: FAST & FREE Shipping on All Orders",
    "Warranty: Full 61-Days through the Manufacturer",
    "Turn Model: M3RRILL",
    "Length to Weight Ratio: Drop 3",
    "Colorway: Red w/ Gold Accents",
    "Swing Feel: Slightly End-Loaded",
    "Hitting Style: Built for Contact & Power Hitters",
    "Bat Material: High-Quality, Hard Maple Wood",
    "Knob: Flared",
    "Handle: Thin",
    "Barrel Diameter: 2 1/2 Inch",
    "Ink Dot Certified: For Pro Grade Durability",
    "Cupped End: Helps Improve Weight Distribution",
    "ProPACT Finish: Provides Hard Surface & Maximum Durability"
  ]
}