{
  "name": "h3",
  "price": 209.95,
  "description": "Unleash your potential on the field with the Victus ALT13 Torpedo Pro Reserve Maple Wood Baseball Bat. Designed to dominate, this top-tier bat boasts a unique Torpedo3 barrel that will help you hit bombs and seek out new competition. With its balanced feel and traditional knob, it's engineered for precision and power. Experience the unmatched durability of the ProPACT finish, and rest assured with its Big League-grade ink dot certification. Proudly made in the USA, the Torpedo Pro Reserve is your key to sending shockwaves through the ballpark. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 61 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/victus-alt13-torpedo-pro-reserve-maple-wood-baseball-bat-vrwmalttor",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/v/r/vrwmalttorhero2.jpg",
  "warranty": "Length to Weight Ratio: Drop 3",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/v/r/vrwmalttorhero2.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\victus-alt13-torpedo-pro-reserve-maple-wood-baseball-bat-vrwmalttor_1.jpg"
  ],
  "category_path": [
    "Bats",
    "Victus ALT13 Torpedo Pro Reserve Maple Wood Baseball Bat: VRWMALTTOR"
  ],
  "features": [
    "FAST & FREE Shipping: Included",
    "Warranty: Full 61-Days through the Manufacturer",
    "Length to Weight Ratio: Drop 3",
    "Colorway: Grey",
    "Swing Feel: Balanced",
    "Bat Material: Maple Wood",
    "Knob: Flared",
    "Handle: Medium",
    "Torpedo2 Barrel: Maximized Sweet Spot",
    "Ink Dot Certified: For Pro Grade Durability"
  ]
}