{
  "name": "h3",
  "price": 209.95,
  "description": "Discover the Victus Top Torpedo Pro Reserve Maple Wood Baseball Bat, designed for elite performance with its balanced swing feel. This bat features a stunning natural and black colorway, making it as visually striking as it is effective on the field. Engineered with a maximized sweet spot, the Torpedo3 barrel ensures powerful hits every time. The traditional knob and medium handle provide a comfortable grip, while its Ink Dot Certification guarantees pro-grade durability. Experience the perfect blend of style and performance with a drop 3 length-to-weight ratio that optimizes your swing. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 61 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/victus-top-torpedo-pro-reserve-maple-wood-baseball-bat-vrwmtoptor",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/v/r/vrwmtoptorhero.jpg",
  "warranty": "Length to Weight Ratio: Drop 3",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/v/r/vrwmtoptorhero.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\images\\victus-top-torpedo-pro-reserve-maple-wood-baseball-bat-vrwmtoptor_1.jpg"
  ],
  "category_path": [
    "Bats"
  ],
  "features": [
    "FAST & FREE Shipping: Included",
    "Warranty: Full 61-Days through the Manufacturer",
    "Length to Weight Ratio: Drop 3",
    "Colorway: Natural & Black",
    "Swing Feel: Balanced",
    "Bat Material: Maple Wood",
    "Knob: Traditional",
    "Handle: Medium",
    "Torpedo3 Barrel: Maximized Sweet Spot",
    "Ink Dot Certified: For Pro Grade Durability"
  ]
}