{
  "name": "h3",
  "price": 399.99,
  "description": "The 2025 Marucci Echo Connect DMND Drop 10 Fastpitch Softball Bat is engineered for peak performance, offering a balanced swing feel with a slightly end-loaded design to add momentum for stronger hits. Certified by USSSA 1.20, ISA, WBSC, NSA, and USA Softball (ASA), this bat meets the highest standards for competitive play. Its two-piece composite construction, featuring the MDX MAX Composite Barrel, ensures durability while delivering an ultra-responsive pop and satisfying sound on contact. The Outer-Locking System (OLS) minimizes vibration and enhances stiffness, while the micro-perforated soft-touch grip provides a comfortable swing with extra tack. With its sleek grey, silver, and white colorway, this bat is as stylish as it is powerful. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2025-marucci-echo-connect-dmnd-drop-10-fastpitch-softball-bat-mfpecd210",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/f/mfpecd210.jpg",
  "warranty": "Length to Weight Ratio: Drop 10",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/f/mfpecd210.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\2025_Marucci_Echo_Connect_DMND_Drop_10_Fastpitch_Softball_Bat_MFPECD210\\images\\2025-marucci-echo-connect-dmnd-drop-10-fastpitch-softball-bat-mfpecd210_1.jpg"
  ],
  "category_path": [
    "2025 Marucci Echo Connect DMND Drop 10 Fastpitch Softball Bat: MFPECD210",
    "Bats",
    "Softball Bats",
    "Fastpitch Bats"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on ALL Orders",
    "Warranty: Full 1-Year through the Manufacturer",
    "Length to Weight Ratio: Drop 10",
    "Certification: USSSA 1.20, ISA, WBSC, NSA, & USA Softball (ASA)",
    "Swing Feel: Balanced",
    "Bat Material: Two-Piece Composite",
    "Barrel Diameter: 2 1/4 Inch",
    "Colorway: Grey, Silver & White",
    "Slightly End-Loaded: Adds momentum for stronger hits",
    "Two-Piece Composite: Designed for durability and performance",
    "MDX MAX Composite Barrel: Delivers ultra-responsive pop and great sound",
    "Outer-Locking System (OLS): Reduces vibration and enhances stiffness",
    "Micro-Perforated Soft-Touch Grip: For a Comfortable Swing & Extra Tack"
  ]
}