{
  "name": "h3",
  "price": 349.99,
  "description": "The 2026 Marucci CATX RCKLESS BBCOR Baseball Bat is engineered for peak performance with its drop 3 length to weight ratio and BBCOR .50 certification, making it ideal for high school and college players. Featuring a 2 5/8 inch barrel diameter and a balanced swing feel, this one-piece alloy bat delivers exceptional responsiveness and plate performance thanks to its proprietary AZR Alloy. The bat's ring-free barrel construction enhances barrel flex and production, while the multi-variable wall design creates an expanded sweet spot with forgiving barrel walls. Additional features include an AV3 Vibration Dampener to absorb vibrations for superior comfort, a TFX End Cap for increased forgiveness, a custom knob design for better grip, and an enhanced soft touch grip for improved feel and control. The striking colorway of black, sky blue, and red adds a bold, modern aesthetic to this high-performance bat. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-marucci-catx-rckless-bbcor-baseball-bat-mcbcr",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/c/mcbcr.jpg",
  "warranty": "Length to Weight Ratio: Drop 3 (-3)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/c/mcbcr.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\2026_Marucci_CATX_RCKLESS_BBCOR_Baseball_Bat_MCBCR\\images\\2026-marucci-catx-rckless-bbcor-baseball-bat-mcbcr_1.jpg"
  ],
  "category_path": [
    "2026 Marucci CATX RCKLESS BBCOR Baseball Bat: MCBCR",
    "Bats"
  ],
  "features": [
    "Delivery: Free & Fast Shipping on all orders",
    "Warranty: Full twelve (12) months through the manufacturer",
    "Length to Weight Ratio: Drop 3 (-3)",
    "Certification: BBCOR .50 Certified",
    "Barrel Diameter: 2 5/8 Inch",
    "Swing Feel: Balanced",
    "Bat Material: One-piece alloy",
    "Colorway: Black, Sky Blue, & Red",
    "Ring-Free Barrel Construction: Enhances barrel flex & overall bat production",
    "AZR Alloy: Ensures optimal plate performance & bat responsiveness",
    "AV3 Vibration Dampener: Absorbs vibrations & sting for feel & comfort",
    "Multi-Variable Wall Design: Expanded sweet spot w/ forgiving barrel walls",
    "TFX End Cap: Softer end cap increases forgiveness",
    "Custom Knob Design: Optimized knob shape for each drop for better feel",
    "Enhanced Soft Touch Grip: Enhances feel & control"
  ]
}