{
  "name": "div",
  "price": 49.95,
  "description": "Enhance your base-running performance with Franklin Sports' MLB CFX Baseball + Softball Sliding Mitt, the official sliding gloves of the MLB. These expertly designed mitts offer superior protection for your hands while stealing bases, thanks to their innovative soft-shell design that hardens on impact, safeguarding your fingers and hands from jams and sprains. With a reversible design, they can be worn on either hand, ensuring versatility and convenience for every player. The secure, reinforced wrist strap provides additional stability, while the soft, responsive material allows you to maintain control and grip on the bag during steals. Equip yourself with the CFX PRT Sliding Mitt and confidently hit the basepaths knowing your greatest tools are protected. function positionHandler() {\n    return {\n        top: 0,\n        updatePosition() {\n            this.$nextTick(() => {\n                let viewportCenter = window.innerHeight / 2,\n                    parent = this.$el.parentElement,\n                    parentCenter = parent.clientHeight / 2,\n                    blockHeight = this.$el.offsetHeight / 2\n                this.top = viewportCenter - blockHeight;\n            });\n        }\n    };\n} {\n        \"body\": {\n            \"acidAdvancedReportsAjax\": {\"url\":\"https:\\/\\/betterbaseball.com\\/acid_acidreports\\/countViews\\/product\\/id\\/108294\\/\"}        }\n    } BALLPLAYERS KNOW. Email Address SIGN UP EXCLUSIVE DROPS & DEALS Our Superstore Atlanta 133 Carruth Dr Marietta, GA 30060 Directions Store Hours Mon-Sat: 9am - 8pm Sun: 10am - 7pm Customer Service (800) 997-4233 Contact Us FAQs Bat Warranties Returns Track Your Order Our Services Expert Bat Fittings Glove Repair Netting Installations Team Sales About Us Shipping Tools BB Bucks Tax Exempt Bullet Assembly Armor Assembly Gift Card Blog © 2025 by Better Baseball. All rights reserved. Site Map | Term & Conditions | Privacy Policy BALLPLAYERS KNOW. Email Address SIGN UP EXCLUSIVE DROPS & DEALS Our Superstore Atlanta 133 Carruth Dr Marietta, GA 30060 Directions Store Hours Mon-Sat: 9am - 8pm Sun: 10am - 7pm Customer Service (800) 997-4233 Contact Us FAQs Bat Warranties Returns Track Your Order Our Services Expert Bat Fittings Glove Repair Netting Installations Team Sales About Us Shipping Tools BB Bucks Tax Exempt Bullet Assembly Armor Assembly Gift Card Blog © 2025 by Better Baseball. All rights reserved. Site Map | Term & Conditions | Privacy Policy BALLPLAYERS KNOW. Email Address SIGN UP EXCLUSIVE DROPS & DEALS BALLPLAYERS KNOW. Email Address SIGN UP EXCLUSIVE DROPS & DEALS BALLPLAYERS KNOW.",
  "source_url": "https://betterbaseball.com/franklin-cfx-slider-prt-protective-reversible-adult-sliding-glove-23555xx",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/2/3/23555xx-black-gold.jpg",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/2/3/23555xx-black-gold.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Accessories\\images\\franklin-cfx-slider-prt-protective-reversible-adult-sliding-glove-23555xx_1.jpg"
  ],
  "category_path": [
    "Accessories"
  ],
  "features": [
    "Protective: Official sliding mitt of the MLB, designed to protect hands & fingers from jams & sprains during steals and slides",
    "Reversible Design: Can be worn on either the left or right hand for versatile protection",
    "Responsive Feel: Lightweight, soft-shell material allows baserunners to maintain finger mobility for grabbing the bag",
    "Secure Wrist Wrap: Reinforced wrist strap ensures a snug fit & provides added wrist stability",
    "Impact Resistant: Engineered & tested for maximum impact dispersion to deliver confidence & safety on the basepaths"
  ]
}