{
  "name": "div",
  "price": 70.0,
  "description": "The Tanner Pro Replacement Standard Batting Tee - Stem Only is an essential upgrade for any serious baseball or softball player looking to enhance their training setup. This fully assembled stem features a robust construction with two strong metal sections and a thick-walled steel thread system, ensuring durability and stability during practice. Its patented FlexTop design allows for a realistic ball feel, making it ideal for improving batting skills. Available in all three sizes, the Tanner Pro stems are compatible with any of the four Tanner base options, offering flexibility and customization for players of all levels. Whether you're adjusting for a growing youth athlete or replacing a worn-out component, this replacement stem provides a cost-effective solution to keep your equipment in top condition. function positionHandler() {\n    return {\n        top: 0,\n        updatePosition() {\n            this.$nextTick(() => {\n                let viewportCenter = window.innerHeight / 2,\n                    parent = this.$el.parentElement,\n                    parentCenter = parent.clientHeight / 2,\n                    blockHeight = this.$el.offsetHeight / 2\n                this.top = viewportCenter - blockHeight;\n            });\n        }\n    };\n} {\n        \"body\": {\n            \"acidAdvancedReportsAjax\": {\"url\":\"https:\\/\\/betterbaseball.com\\/acid_acidreports\\/countViews\\/product\\/id\\/140769\\/\"}        }\n    } BALLPLAYERS KNOW. Email Address SIGN UP EXCLUSIVE DROPS & DEALS Our Superstore Atlanta 133 Carruth Dr Marietta, GA 30060 Directions Store Hours Mon-Sat: 9am - 8pm Sun: 10am - 7pm Customer Service (800) 997-4233 Contact Us FAQs Bat Warranties Returns Track Your Order Our Services Expert Bat Fittings Glove Repair Netting Installations Team Sales About Us Shipping Tools BB Bucks Tax Exempt Bullet Assembly Armor Assembly Gift Card Blog © 2025 by Better Baseball. All rights reserved. Site Map | Term & Conditions | Privacy Policy BALLPLAYERS KNOW. Email Address SIGN UP EXCLUSIVE DROPS & DEALS Our Superstore Atlanta 133 Carruth Dr Marietta, GA 30060 Directions Store Hours Mon-Sat: 9am - 8pm Sun: 10am - 7pm Customer Service (800) 997-4233 Contact Us FAQs Bat Warranties Returns Track Your Order Our Services Expert Bat Fittings Glove Repair Netting Installations Team Sales About Us Shipping Tools BB Bucks Tax Exempt Bullet Assembly Armor Assembly Gift Card Blog © 2025 by Better Baseball. All rights reserved. Site Map | Term & Conditions | Privacy Policy BALLPLAYERS KNOW. Email Address SIGN UP EXCLUSIVE DROPS & DEALS BALLPLAYERS KNOW. Email Address SIGN UP EXCLUSIVE DROPS & DEALS BALLPLAYERS KNOW.",
  "source_url": "https://betterbaseball.com/tanner-pro-replacement-standard-batting-tee-stem-only-tprstem1",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/t/p/tprstem1_alt1.jpg",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/t/p/tprstem1_alt1.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Accessories\\images\\tanner-pro-replacement-standard-batting-tee-stem-only-tprstem1_1.jpg"
  ],
  "category_path": [
    "Accessories"
  ],
  "features": [
    "Product Type: Replacement stem for Tanner Pro Tee",
    "Construction: Two strong metal sections with thick-walled steel thread system",
    "Top Feature: Includes patented FlexTop for a smooth, durable hitting experience",
    "Compatibility: Fits all four Tanner base options",
    "Note: Replacement stem only – base not included"
  ]
}