{
  "name": "h3",
  "price": 399.99,
  "description": "The 2026 Marucci CATX RCKLESS Composite Drop 8 USSSA Baseball Bat is a powerhouse on the field, designed for players seeking performance and style. With a slightly end-loaded swing feel and a 2 3/4 inch barrel diameter, this bat is USSSA 1.15 BPF certified, ensuring top-tier playability. Its two-piece composite design boasts a FLEX Composite Barrel for maximum performance and barrel responsiveness, while the Ring-Free Barrel Construction enhances barrel flex and overall production. The OLS Connection provides the stiffest connection to minimize vibrations for smoother swings, complemented by a TFX End Cap that increases forgiveness. Finished in a striking black, teal, and purple colorway, this bat also features a PFX Composite Handle for enhanced speed, power, and feel, along with a custom knob design and enhanced soft touch grip for superior control. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 365 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/2026-marucci-catx-rckless-composite-drop-8-usssa-baseball-bat-msbcrc8",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcrc8.jpg",
  "warranty": "Length to Weight Ratio: Drop 8 (-8)",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/s/msbcrc8.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\2026_Marucci_CATX_RCKLESS_Composite_Drop_8_USSSA_Baseball_Bat_MSBCRC8\\images\\2026-marucci-catx-rckless-composite-drop-8-usssa-baseball-bat-msbcrc8_1.jpg"
  ],
  "category_path": [
    "2026 Marucci CATX RCKLESS Composite Drop 8 USSSA Baseball Bat: MSBCRC8",
    "Bats"
  ],
  "features": [
    "Delivery: Free & Fast Shipping on all orders",
    "Warranty: Full twelve (12) months through the manufacturer",
    "Length to Weight Ratio: Drop 8 (-8)",
    "Certification: USSSA 1.15 BPF Certified",
    "Barrel Diameter: 2 3/4 Inch",
    "Swing Feel: Slightly end-loaded",
    "Bat Material: Two-piece composite",
    "Colorway: Black, teal, & purple",
    "Ring-Free Barrel Construction: Enhances barrel flex & overall bat production",
    "FLEX Composite Barrel: Ensures max performance & barrel responsiveness",
    "OLS Connection: Stiffest connection that reduces vibrations for smooth swings",
    "TFX End Cap: Softer end cap increases forgiveness",
    "PFX Composite Handle: Engineered by bat drop enhancing speed, power, & feel",
    "Custom Knob Design: Optimized knob shape for each drop for better feel",
    "Enhanced Soft Touch Grip: Enhances feel & control"
  ]
}