{
  "name": "div",
  "price": 34.99,
  "description": "Elevate your game with the Marucci Youth Padded Slider Shorts w/ Cup, designed to ensure comfort and protection at the highest level of play. Featuring anti-microbial, moisture-management fabric, these shorts keep you dry and comfortable during intense games and practices. The inclusion of spandex fabric provides ease of movement, while quilted sponge side panels offer extra protection where it's needed most. An elastic stretch waistband with sublimated Marucci logos ensures a secure fit, and the included cup adds an essential layer of safety. Perfect for young athletes seeking superior performance and protection on the field. function positionHandler() {\n    return {\n        top: 0,\n        updatePosition() {\n            this.$nextTick(() => {\n                let viewportCenter = window.innerHeight / 2,\n                    parent = this.$el.parentElement,\n                    parentCenter = parent.clientHeight / 2,\n                    blockHeight = this.$el.offsetHeight / 2\n                this.top = viewportCenter - blockHeight;\n            });\n        }\n    };\n} {\n        \"body\": {\n            \"acidAdvancedReportsAjax\": {\"url\":\"https:\\/\\/betterbaseball.com\\/acid_acidreports\\/countViews\\/product\\/id\\/119487\\/\"}        }\n    } BALLPLAYERS KNOW. Email Address SIGN UP EXCLUSIVE DROPS & DEALS Our Superstore Atlanta 133 Carruth Dr Marietta, GA 30060 Directions Store Hours Mon-Sat: 9am - 8pm Sun: 10am - 7pm Customer Service (800) 997-4233 Contact Us FAQs Bat Warranties Returns Track Your Order Our Services Expert Bat Fittings Glove Repair Netting Installations Team Sales About Us Shipping Tools BB Bucks Tax Exempt Bullet Assembly Armor Assembly Gift Card Blog © 2025 by Better Baseball. All rights reserved. Site Map | Term & Conditions | Privacy Policy BALLPLAYERS KNOW. Email Address SIGN UP EXCLUSIVE DROPS & DEALS Our Superstore Atlanta 133 Carruth Dr Marietta, GA 30060 Directions Store Hours Mon-Sat: 9am - 8pm Sun: 10am - 7pm Customer Service (800) 997-4233 Contact Us FAQs Bat Warranties Returns Track Your Order Our Services Expert Bat Fittings Glove Repair Netting Installations Team Sales About Us Shipping Tools BB Bucks Tax Exempt Bullet Assembly Armor Assembly Gift Card Blog © 2025 by Better Baseball. All rights reserved. Site Map | Term & Conditions | Privacy Policy BALLPLAYERS KNOW. Email Address SIGN UP EXCLUSIVE DROPS & DEALS BALLPLAYERS KNOW. Email Address SIGN UP EXCLUSIVE DROPS & DEALS BALLPLAYERS KNOW.",
  "source_url": "https://betterbaseball.com/marucci-youth-padded-slider-with-cup-maslcp",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/a/masl_white_1.jpg",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/m/a/masl_white_1.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Apparel\\images\\marucci-youth-padded-slider-with-cup-maslcp_1.jpg"
  ],
  "category_path": [
    "Apparel"
  ],
  "features": [
    "Enhanced Mobility: Spandex fabric added for unrestricted ease of movement",
    "Moisture-Wicking: Anti-microbial, moisture-management material keeps players dry & comfortable",
    "Impact Protection: Quilted sponge side panels provide extra padding where it’s needed most",
    "Secure Fit: Elastic stretch waistband with sublimated Marucci logos ensures a snug, athletic fit",
    "Added Safety: Includes protective cup for complete lower-body protection",
    "Durable Construction: 82% polyester / 11% spandex / 7% sponge padding for comfort & performance"
  ]
}