{
  "name": "h3",
  "price": 159.95,
  "description": "The Tucci Bo Bichette Pro Select Maple Wood Baseball Bat is a powerhouse on the field, designed for players seeking enhanced performance and precision. Featuring a Drop 3 length to weight ratio, this bat offers a slightly end-loaded swing feel, delivering added power with each hit. Its light brown colorway adds a touch of elegance, while the tapered knob ensures comfort and control during play. The thin handle provides maximum whip, complementing the extended medium barrel that offers a greater sweet spot and improved balance. Ink Dot Certified, this bat guarantees pro-grade durability, making it an ideal choice for serious athletes. Warranty chevron-down chevron-down chevron-down Warranty A Full Manufacturer's Warranty of 30 Days is included. If a warranty issue arises, our Bat Experts are happy to assist you in reaching the manufacturer to get a fast replacement! Begin Your Claim Here: Start My Warranty Claim",
  "source_url": "https://betterbaseball.com/catalog/product/view/id/169231/s/tucci-bo-bichette-pro-select-maple-baseball-bat-tl-bo11/category/17/",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/t/l/tl-bo11.jpg",
  "warranty": "Length to Weight Ratio: Drop 3",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/t/l/tl-bo11.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Bats\\Baseball_Bats\\Wood_Bats\\images\\17_1.jpg"
  ],
  "category_path": [
    "Bats",
    "Baseball Bats",
    "Wood Bats"
  ],
  "features": [
    "Fast & Free Shipping: Included",
    "Warranty: Full 60-Days through the Manufacturer",
    "Length to Weight Ratio: Drop 3",
    "Colorway: Light Brown",
    "Swing Feel: Slightly end-loaded for added power",
    "Bat Material: Maple Wood",
    "Knob: Tapered for comfort & control",
    "Handle: Thin for maximum whip",
    "Extended Medium Barrel: Greater sweet spot with more balance",
    "Ink Dot Certified: For pro grade durability"
  ]
}