{
  "name": "footer",
  "price": 299.95,
  "description": "The three-in-one practice trainer. Great for backyard and on-field training. Work on grounders, line drives, and pop flies with this easy to use design. No assembly required! Improve your footwork and agility with the grounder's setting. Warm-up before practice and games with the line drive setting. Track fly balls with the pop fly setting. To change settings, just simply adjust the legs. The three-piece design is easy to set up and makes training quick and fun. The steel frame is built to last and is designed for little league to major league throwing velocities. WARNING: This screen is intended to protect the pitcher or nearby players during batting practice or practice drills. However, it is possible a batted ball may ricochet off the screen and hit the batter or a nearby player, causing serious injury or even death. Batters, pitchers, and nearby players should always wear appropriate protective equipment while using this product. WARNING: This screen is intended to protect the pitcher or nearby players during batting practice or practice drills. However, it is possible a batted ball may ricochet off the screen and hit the batter or a nearby player, causing serious injury or even death. Batters, pitchers, and nearby players should always wear appropriate protective equipment while using this product. WARNING: This screen is intended to protect the pitcher or nearby players during batting practice or practice drills. However, it is possible a batted ball may ricochet off the screen and hit the batter or a nearby player, causing serious injury or even death. Batters, pitchers, and nearby players should always wear appropriate protective equipment while using this product. WARNING: This screen is intended to protect the pitcher or nearby players during batting practice or practice drills. However, it is possible a batted ball may ricochet off the screen and hit the batter or a nearby player, causing serious injury or even death. Batters, pitchers, and nearby players should always wear appropriate protective equipment while using this product. function positionHandler() {\n    return {\n        top: 0,\n        updatePosition() {\n            this.$nextTick(() => {\n                let viewportCenter = window.innerHeight / 2,\n                    parent = this.$el.parentElement,\n                    parentCenter = parent.clientHeight / 2,\n                    blockHeight = this.$el.offsetHeight / 2\n                this.top = viewportCenter - blockHeight;\n            });\n        }\n    };\n} {\n        \"body\": {\n            \"acidAdvancedReportsAjax\": {\"url\":\"https:\\/\\/betterbaseball.com\\/acid_acidreports\\/countViews\\/product\\/id\\/87682\\/\"}        }\n    } BALLPLAYERS KNOW. Email Address SIGN UP EXCLUSIVE DROPS & DEALS Our Superstore Atlanta 133 Carruth Dr Marietta, GA 30060 Directions Store Hours Mon-Sat: 9am - 8pm Sun: 10am - 7pm Customer Service (800) 997-4233 Contact Us FAQs Bat Warranties Returns Track Your Order Our Services Expert Bat Fittings Glove Repair Netting Installations Team Sales About Us Shipping Tools BB Bucks Tax Exempt Bullet Assembly Armor Assembly Gift Card Blog © 2025 by Better Baseball. All rights reserved. Site Map | Term & Conditions | Privacy Policy",
  "source_url": "https://betterbaseball.com/baseball-pitch-back-rebounder-bullettripleplay",
  "image_url": "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/b/u/bullettripleplay_red.jpg",
  "image_urls": [
    "https://images.betterbaseball.com/media/catalog/product/cache/ce8709217ad27f0e4f56319828d6c789/b/u/bullettripleplay_red.jpg"
  ],
  "downloaded_images": [
    "C:\\Users\\Harold Ligon\\Documents\\Coding\\SparQDigital\\BBScraper\\prodInfo\\Baseball_Pitch_Back_Rebounder\\images\\baseball-pitch-back-rebounder-bullettripleplay_1.jpg"
  ],
  "category_path": [
    "Baseball Pitch Back Rebounder",
    "Baseball L-Screens"
  ],
  "features": [
    "Delivery: FAST & FREE Shipping on All Orders",
    "Frame: Durable & Rust Resistant 14 Gauge Galvanized Steel Frame",
    "Netting: Long-Lasting #30 UV Treated Nylon, Double Layer Pillowcase Net",
    "Heavy Duty: 18 oz Vinyl & 1 ½” Impact Foam Padding",
    "All-Weather Materials: Provides Protection from Outdoor Elements",
    "Built Tough: For Training Facilities, Schools, & Organizations",
    "Match Team Colors: 11 Different Colorways Available"
  ]
}